<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>WebYep</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="stiles.css" rel="stylesheet" type="text/css">
<link href="print.css" rel="stylesheet" type="text/css" media="print">
</head>

<body bgcolor="#FFFFFF" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<div align="center"><img src="images/logo-print.gif" width="384" height="181"></div>
<div align="center" style="font-size: 32px; font-weight: bold">Documentation</div>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Allgemeines<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>WebYep ist ein &quot;Web Content Management System&quot; - es erm&ouml;glicht also das Bearbeiten von Inhalten einer Website durch Personen ohne WebDesign-Wissen (direkt im Webbrowser). Jede Person, die mit einem Webbrowser umgehen kann, ist in der Lage mittels WebYep Inhalte von Webseiten zu ver&auml;ndern.</p>
      <p>Damit dies m&ouml;glich wird, obliegt es Ihnen als WebDesignerIn, WebYep in die gew&uuml;nschten Seiten einer Website einzuf&uuml;gen und in der Website zu installieren.</p>
      <p>Ein wichtiger Unterschied zu anderen Web Content Management Systemen ist, dass Sie nicht Ihre gesamte Website mit WebYep erstellen m&uuml;ssen. Es gen&uuml;gt, in einzelnen Seiten, deren Inhalt k&uuml;nftig h&auml;ufiger ge&auml;ndert werden soll, die statischen Teile (Texte, Bilder) durch WebYep Elemente zu ersetzen.</p>
      <p>Die vorliegende Dokumentation beinhaltet alle Informationen die Sie ben&ouml;tigen, um WebYep in eine von Ihnen erstellte Website zu integrieren.</p>
      <h3>WebYep im Einsatz </h3>
      <p>Um zu sehen, wie WebYep nach der Integration in eine Webseite f&uuml;r die BenutzerInnen zu bedienen ist (wie also die Texte eingegeben bzw. Bilder hinaufgeladen werden), verwenden Sie bitte die <a href="http://www.obdev.at/webyep/demo-de.html" target="_blank">WebYep Online Demo</a>.</p>
      <p class="remark"><span class="remarkHeading">Wichtig:</span> Diese Dokumentation bezieht sich zum Teil auf das Arbeiten mit der WebYep Erweiterung in <em>Adobe&reg; Dreamweaver<span class="registered">&reg;.</span></em>
        Die vorliegende Dokumentation beruht auf der Dreamweaver Version MX 2004,
        wenngleich die WebYep Dreamweaver<em><span class="registered">&reg;</span></em> Extension auch mit anderen Versionen
      von Dreamweaver funktionsf&auml;hig ist (siehe <a href="system-requirements.html">Systemvoraussetzungen</a>).</p>
      <p class="remark"><span class="remarkHeading">Sie verwenden nicht Dreamweaver?</span><br>
        Im Kapitel <a href="reference/logon-button.html">Referenz</a> werden alle WebYep Elemente auch mit dem zugeh&ouml;rigen PHP Code Fragment erl&auml;utert, damit Sie diese auch mit <em>jedem beliebigen Webseiten Editor</em>, der das Einf&uuml;gen von PHP Code erlaubt, einf&uuml;gen und konfigurieren k&ouml;nnen.</p>
      <!-- InstanceEndEditable -->
      <div><img src="images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Prinzip<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>Im Prinzip geht es bei Web Content Management Systemen darum, Teile einer Webseite f&uuml;r BernutzerInnen direkt im Webbrowser editierbar zu machen. Sie als WebDesignerIn k&ouml;nnen dies den BenutzerInnen erm&ouml;glichen, indem Sie WebYep in die betreffende Website integrieren und WebYep-Elemente in die betreffenden Webseiten einbauen. </p>
      <h3>Website vorbereiten:</h3>
      <ol>
        <li> Wenn Sie Dreamweaver verwenden, die WebYep Dreamweaver
          Extension installieren: Doppelklick auf webyep.mxp, weiter laut dem
          dadurch gestarteten
          
          Extension
          Manager</li>
        <li>Den webyep-system Ordner in das Stammverzeichnis der Website kopieren (wo auch die Startseite - index.html - liegt) </li>
        <li>In der Datei konfiguration.php  Benutzername und Kennwort definieren (schalten Sie ggf. im Dreamweaver auf die Code-Ansicht  &ndash; diese Datei besteht nur aus PHP Code) </li>
        <li>Den webyep-system Ordner zum Server hinaufladen (per FTP) </li>
        <li> WebYep aktivieren (siehe: <a href="#activation">Was ist die &quot;Aktivierung&quot;?</a>) </li>
      </ol>
      <h3>Seiten erstellen:</h3>
      <ol>
        <li>Eine normale HTML-Seite erstellen, aber als Dateiendung nicht &quot;.html&quot; sondern &quot;.php&quot; verwenden. </li>
        <li>Normale (statische) Inhalte einf&uuml;gen um die Seite zu gestalten.</li>
        <li>Wo immer Text oder Bilder editierbar sein sollen, stattdessen  das entsprechende WebYep-Element  in die Seite einf&uuml;gen.
          <br>
          Im  Dreamweaver
          k&ouml;nnen Sie dazu aus der Objektpalette unter &quot;WebYep&quot; das gew&uuml;nschte WebYep Element ausw&auml;hlen. In anderen Editoren setzen Sie den entprechenden PHP Code von Hand ein &ndash; siehe dazu die <a href="reference/index.html">Referenzen</a> der einzelnen WebYep Elemente, vor allem auch f&uuml;r den &quot;<a href="reference/init-code.html">Init Code</a>&quot;) .       </li>
        <li>Irgendwo in der Seite auch einen WebYep-Anmeldeknopf einf&uuml;gen.</li>
        <li>Die Seite zum Server hinaufladen (per FTP). </li>
        <li>Die hochgeladene Seite im WebBrowser aufrufen.</li>
      </ol>
      <p>Weitere Beschreibungen finden Sie unter &quot;<a href="tutorials/index.html">Tutorials</a>&quot; bzw. &quot;<a href="reference/index.html">Referenz</a>&quot; </p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <h3><a name="activation">Was ist die &quot;Aktivierung&quot;?</a></h3>
      <p>Im Dreamweaver wird die Aktivierung in der Remote-Ansicht des Dateifensters durch rechten Klick auf den webyep-system Ordner und Anw&auml;hlen des Men&uuml;punktes &quot;WebYep aktivieren&quot; durchgef&uuml;hrt. Details und Infos zur Aktivierung mittels anderer Programme finden Sie unter &quot;<a href="javascript:window.open('activation-details.html', 'ActivationDetails', 'width=600,height=600')">Aktivierung, Technische Details</a>&quot; und &quot;<a href="installation.html">Installation</a>&quot; </p>
      
      <h3>Was sind die WebYep-Elemente?</h3>
      <p>Die WebYep-Elemente sind kleine PHP-Code-Fragmente die in den HTML-Code
        eingebettet werden. Im Dreamweaver werden diese Elemente &uuml;ber
        die Objektpalette (Kategorie &quot;WebYep&quot;) eingef&uuml;gt. Aber Sie k&ouml;nnen auch in jedem anderen WebSeiten-Editor die entsprechenden PHP-Code-Fragmente manuell einf&uuml;gen &ndash; Details dazu finden Sie in den <a href="reference/logon-button.html">Referenzen</a> der einzelnen WebYep Elemente.</p>
      <h3>Aufbau des webyep-system Ordners</h3>
      <ul>
        <li><b>webyep-system</b>
          <ul>
            <li>konfiguration.php (hier wird Benutzername und Passwort konfiguriert)</li>
            <li>info.php (zeigt Systeminformationen an) </li>
            <li><b>programm</b> beinhaltet alle WebYep Programmdateien</li>
            <li><b>daten</b>
(beinhaltet alle WebYep Daten)           
  <ul>
                <li>documents (Liste der WebYep-Seiten) </li>
                <li>license (Lizenzcodes)</li>
                <li>... diverse Dateien, die die eingegebenen Texte, Bilder,
                  etc. beinhalten</li>
  </ul>
            </li>
          </ul>
        Der &quot;daten&quot; Ordner beinhaltet alle von den Benutzern eingegebenen Daten und sollte daher von Zeit zu Zeit gesichert werden (siehe &quot;<a href="backup.html">Backup</a>&quot;). </li>
      </ul>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Installation<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <h2> WebYep-Dreamweaver-Erweiterung</h2>
      <p>Wenn Sie zur Erstellung Ihrer Webseiten Adobe&reg; Dreamweaver<span class="registered">&reg;</span> verwenden, so k&ouml;nnen
      Sie die WebYep-Dreamweaver-Erweiterung nutzen.</p>
      <p>Die WebYep-Dreamweaver-Erweiterung ist in der Datei <em>&quot;webyep.mxp&quot;</em> enthalten und wird installiert, indem Sie diese Datei einfach doppelklicken - dies startet den <em>&quot;Extension Manager&quot;</em> - folgen Sie dessen Anweisungen um die Erweiterung zu installieren.</p>
      <p>&nbsp;</p>
      <p align="center"><img src="pictures/extension-manager.gif" width="521" height="314"><br>
      <span class="picturetext">Der Extension Manager mit installierter WebYep-Dreamweaver-Erweiterung</span></p>
      <blockquote>
        <p><span class="notice">Hinweis:</span> Sollten Sie mehrere Adobe&reg; Programme installiert haben, so k&ouml;nnen Sie die WebYep-Erweiterung von einem (zB. Dreamweaver Ultradev) zum anderen (zB. Dreamweaver) im Extension Manager durch den Men&uuml;punkt &quot;Datei / Erweiterung importieren...&quot; &uuml;bertragen.</p>
      </blockquote>
      <h2>Der webyep-system Ordner</h2>
      <p>Die Haupt-Komponente von WebYep besteht aus einer Reihe von Programmdateien
        die in einem <em>Ordner namens &quot;webyep-system&quot;</em> zusammengefasst
        sind. Dieser <em>webyep-system Ordner</em> wird zu den anderen Dateien
        Ihrer Website gelegt, am besten in das <em>Stammverzeichnis</em> (wo
        auch die Startseite Ihrer Website - meist &quot;index.html&quot; bzw.
        &quot;index.php&quot; genannt - liegt). </p>
      <p align="center"><img src="pictures/install-local.gif" width="539" height="270"><br>
      <span class="picturetext">Der webyep-system Ordner im Stammverzeichnis einer Website</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>Bevor Sie WebYep am Webserver installieren, sollten Sie noch die n&ouml;tige
        Konfigurationseinstellung vornehmen: Wenn die BenutzerInnen der Website &Auml;nderungen
        an einer Seite vornehmen wollen, m&uuml;ssen diese sich per <em>Name
        und Kennwort</em> identifizieren (nach Klick auf das Schloss-Symbol
        in der Seite). Dieser Name und das Kennwort sind die einzigen Konfigurationseinstellungen,
        die vorzunehmen sind: </p>
      <p></p>
      <ol>
        <li>&Ouml;ffnen Sie die Datei &quot;konfiguration.php&quot; im webyep-system Ordner.</li>
        <li>Schalten Sie auf die <em>Quelltextansicht</em> um - diese Datei ist <em>keine HTML-Datei</em> sondern eine Textdatei.</li>
        <li>Tragen Sie innerhalb der Anf&uuml;hrungszeichen die gew&uuml;nschten Werte f&uuml;r <span class="codeExample">webyep_sAdminName</span> und <span class="codeExample">webyep_sAdminPassword</span> ein - diese k&ouml;nnen von Ihnen <em>frei gew&auml;hlt</em> werden!</li>
      </ol>
      <p>Zum Beispiel:</p>
      <blockquote class="codeExample"> // Name und Kennwort f&uuml;r den &quot;Bearbeiten&quot;-Modus.<br>
  // Diese k&ouml;nnen von Ihnen frei gew&auml;hlt werden und m&uuml;ssen von den<br>
  // EditorInnen der Website beim Anmelden (Klick auf das Schloss-Symbol) angegeben<br>
  // werden, um die Seiten bearbeiten zu d&uuml;rfen.<br>
  $webyep_sAdminName = &quot;<b><span class="emsource" color="#990000">admin</span></b>&quot;;<br>
  $webyep_sAdminPassword = &quot;<b><span class="emsource" color="#990000">test</span></b>&quot;;</blockquote>
      <h3> Zeichenkodierungen</h3>
      <p>Weiters k&ouml;nnen Sie mit der Konfigurationsvariable <span class="codeExample">$webyep_sCharset</span> die verwendete Zeichenkodierung (Character Set) einstellen. Dies ist immer dann erforderlich, wenn sie eine andere Kodierung als ISO Latin 1 (iso-8859-1) verwenden.</p>
      <p> Unabh&auml;ngig von WebYep ist beim Gestalten Ihrer Webseiten dann aber auch zu beachten, dass Sie in die Seiten  die korrekten
        Meta-Tags f&uuml;r
          die Zeichenkodierung (content-type, charset)
          einf&uuml;gen!</p>
      <h2><a name="server_installation">Installation am Server </a></h2>
      <p>Um WebYep auf dem Webserver zu installieren, ist der webyep-system Ordner einfach mit den restlichen Dateien Ihrer Website auf den Server zu &uuml;bertragen (&quot;upload&quot;). Sie k&ouml;nnen dies mit jedem beliebigen FTP oder SCP Programm durchf&uuml;hren oder direkt im Dreamweaver, im Sitefenster, mittels &quot;Datei(en) bereitstellen&quot;.</p>
      <p align="center"><img src="pictures/upload.gif" width="280" height="245"><br>
      <span class="picturetext">Der webyep-system Ordner wird mit den anderen Dateien der Website auf den Server &uuml;berspielt</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>Damit WebYep die von den BenutzerInnen eingegebenen Daten speichern kann, ben&ouml;tigt es  die Berechtigung, Dateien auf dem Server zu speichern. Daher muss WebYep &quot;aktiviert&quot; werden.</p>
      <p>N&auml;here Details und Informationen zur Aktivierung mittels anderer Programme als Dreamweaver finden Sie unter &quot;<a href="javascript:window.open('activation-details.html', 'ActivationDetails', 'width=600,height=600')">Aktivierung, Technische Details</a>&quot;. </p>
      <p>Um die Aktivierung mit Dreamweaver durchzuf&uuml;hren, klicken Sie mit der <b>rechten
          Maustaste</b> auf den <b>webyep-system Ordner</b> in der <b>Liste der
          Server-Dateien</b> und w&auml;hlen im erscheinenden Kontextmen&uuml; den
          Men&uuml;punkt &quot;WebYep aktivieren&quot;.</p>
      <p align="center"><img src="pictures/activate.gif" width="277" height="425"><br>
        <span class="picturetext">Die Liste der Dateien auf dem <b>Webserver</b>.<br>
  In dieser Liste mit der <b>rechten Maustaste</b> auf den webyep-system Ordner
  klicken<br>
  und im erscheinenden Men&uuml; &quot;WebYep aktivieren&quot; w&auml;hlen.</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>Ob Sie WebYep am Server korrekt installiert und aktiviert haben, k&ouml;nnen
        Sie durch Aufrufen folgenden URLs &uuml;berpr&uuml;fen:</p>
      <blockquote>
        <p>http://<i>www.meinewebsite.com</i>/webyep-system/info.php</p>
      </blockquote>
      <h2>Zusammenfassung</h2>
      <ul>
        <li><b>Die Dreamweaver-Erweiterung:</b><br>
  Eine Datei namens &quot;webyep.mxp&quot; - sie enth&auml;lt die  Eingabemasken,
  Eigenschaftsfenster, etc. f&uuml;r Dreamweaver<span class="registered">&reg;</span>. Die Erweiterung ist durch Doppelklick auf diese Datei (startet den &quot;Extension Manager&quot;) zu installieren.</li>
        <li><b>Der webyep-system Ordner:</b><br>
  Ein Ordner namens &quot;webyep-system&quot; u.a. mit diversen Programmdateien (PHP-Dateien).<br>
  Diesen Ordner in das Stammverzeichnis Ihrer Website kopieren. </li>
              <li><b>Konfiguration:</b><br>
    Name und Kennwort in der Datei &quot;konfiguration.php&quot; einstellen.</li>
        <li><b>Installation am Server:</b><br>
    Den webyep-system Ordner (Ordner namens &quot;webyep-system&quot;) mit den anderen Dateien der Website auf den Server &uuml;berspielen.</li>
        <li><b>Aktivierung:</b><br>
Im Dreamweaver:   Klick mit rechter Maustaste auf den webyep-system Ordner in der Liste der
    Dateien am Server &#8211; Kontext-Men&uuml;-Punkt &quot;WebYep aktivieren&quot; w&auml;hlen. Oder mit einem beliebigen FTP/SCP Programm nach dem Upload die Zugriffsrechte des Ordners &quot;daten&quot; im webyep-system Ordner entsprechend setzen.</li>
        <li><b>&Uuml;berpr&uuml;fung:</b><br>
  Sie k&ouml;nnen die Installation am Server mit dem URL<br>
  http://<i>www.meinewebsite.com</i>/webyep-system/info.php &uuml;berpr&uuml;fen.</li>
      </ul>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <!-- InstanceEndEditable -->
      <div><img src="images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<div class="content">  <h2>Aktivierung, Technische Details </h2>
  <p>Technisch gesehen werden bei der Aktivierung die Unix-Datei-Rechte f&uuml;r einen bestimmen <em>Unterordner</em> des webyep-system Ordners (namens <em>&quot;daten&quot;</em>) gesetzt und zwar auf den Wert &quot;schreiben, lesen und ausf&uuml;hren erlauben f&uuml;r: alle&quot; - dies entspricht dem Unix Modus &quot;<em>0777</em>&quot;.</p>
  <p class="remark"><span class="remarkHeading">Warnung:</span> Eine unsichere PHP Konfiguration durch den Provider kann dazu f&uuml;hren, dass PHP Skripts in anderen Websites dieses Providers oder Anfreifer von au&szlig;en auf die WebYep-Daten Ihrer Website zugreifen k&ouml;nnen. Dies gilt nicht nur f&uuml;r WebYep sondern <em>f&uuml;r alle PHP Skripts Ihrer Website</em>! Informieren Sie sich ggf. bei Ihrem Provider, ob die PHP Engine Ihres Webspaces sicher konfiguriert ist (durch entsprechende Einstellung von &quot;open_base_dir&quot; und Abschalten von &quot;register_globals&quot; und &quot;allow_url_fopen&quot;).</p>
  <p>Um WebYep ohne Dreamweaver zu &quot;aktivieren&quot;, m&uuml;ssen also die Zugriffsrechte das &quot;daten&quot; Ordners innerhalb des webyep-system Ordners am Server entsprechend gesetzt werden.</p>
  <p>Hier als Beispiel die Vorgehensweise bei Verwendung des Programms &quot;CyberDuck&quot; zum FTP Transfer:</p>
  <p align="center"><img src="pictures/activate_any_ftp.jpg" width="450" height="372"></p>
  <p>Klicken Sie sich zum &quot;daten&quot; Ordner im webyep-system Ordner durch. Klicken Sie diesen dann mit der rechten Maustaste an (bzw. bei gehaltener Strg Taste) und w&auml;hlen Sie aus dem erscheinenden Men&uuml; &quot;Info&quot;.</p>
  <p>Im erscheinenden Fenster k&ouml;nnen Sie nun die Zugriffsrechte setzen &ndash; klicken Sie danach auf &quot;Anwenden&quot;.</p>
</div>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Backup (Datensicherung) <!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>Die Texte und Bilder etc., die von den EditorInnen in die Web-Seiten
        eingegeben werden, speichert WebYep in Form mehrerer Dateien am Webserver
        im webyep-system Ordner. Auch wenn der Provider Ihre Website in regelm&auml;&szlig;igen
        Abst&auml;nden Sicherungskopien erstellen sollte, kann es nicht schaden,
        ab und zu selbst eine Sicherungskopie der Daten zu erstellen.</p>
      <h2>Wo speichert WebYep die Daten?</h2>
      <p>Wenn Sie im Dreamweaver eine FTP-Verbindung zum Webserver herstellen und einen Blick in den webyep-system Ordner <em>am Server</em> (nicht den auf Ihrem PC/Mac) werfen, finden Sie darin einen Unterordner namens &quot;daten&quot;. In diesem Unterordner speichert WebYep s&auml;mtliche von den BenutzterInnen/EditorInnen der Website eingegeben Daten.</p>
      <p>Zum Sichern der Daten m&uuml;ssen Sie lediglich diesen Ordner (samt Inhalt) vom Server auf Ihren PC/Mac &uuml;bertragen.</p>
      <h2>Wie spiele ich die gesicherten Daten wieder zur&uuml;ck?</h2>
      <p>Sollten die Daten am Server einmal wirklich wiederhergestellt werden
        m&uuml;ssen, gehen Sie folgenderma&szlig;en
        vor:</p>
      <ol>
        <li>L&ouml;schen Sie den gesamten webyep-system Ordner am Server, wenn er dort noch existiert. Wenn Daten am Server verloren gegangen sind, ist es relativ wahrscheinlich, dass WebYep dabei ebenfalls besch&auml;digt wurde.</li>
        <li>Installieren Sie WebYep am Server neu (siehe <a href="installation.html#server_installation">Installation am Server</a>).</li>
        <li>Ersetzen Sie den &quot;daten&quot;-Ordner am Server (im webyep-system Ordner) durch Ihre Sicherungskopie (l&ouml;schen Sie den &quot;daten&quot;-Ordner am Server und &uuml;bertragen sie stattdessen Ihre Kopie an diese Stelle)</li>
        <li>&quot;Aktivieren&quot; Sie WebYep erneut (siehe <a href="installation.html#activation">Installation am Server</a>).</li>
        <li>Ggf. m&uuml;ssen Sie beim ersten Aufruf der Website dann den Lizenzcode
          erneut eingeben.</li>
      </ol>
      <p>Achten Sie dabei darauf, dass Sie die richtige <em>Version von WebYep</em> installieren - nicht alle Versionen von WebYep sind &quot;datenkompatibel&quot;. Sie k&ouml;nnen die installierte WebYep Version durch Aufrufen der Seite http://<i>www.meinewebsite.com</i>/webyep-system/info.php &uuml;berpr&uuml;fen. </p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Systemvoraussetzungen<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>Um WebYep in Ihre Website zu integrieren, ben&ouml;tigen Sie <em>keine
          zus&auml;tzlichen Werkzeuge</em> - die Programme mit denen Sie &uuml;blicherweise
          Webseiten erzeugen, reichen aus, um WebYep in Ihre Seiten einzubinden.</p>
      <p>F&uuml;r den HTML-Editor <em>Dreamweaver<span class="registered">&reg;</span></em> (ab Version <em>MX</em>) der Firma Adobe<em><span class="registered">&reg;</span></em> steht allerdings eine <em>Erweiterung (Extension)</em> bereit, mit der es besonders einfach ist, WebYep in Ihre Webseiten zu integrieren. Mit Dreamweaver und der WebYep-Dreamweaver-Erweiterung ist die Integration von WebYep in eine Seite ebenso einfach wie das Einf&uuml;gen eines herk&ouml;mmlichen Bildes.</p>
      <p>Wenn Sie <em>Dreamweaver MX 2004</em> (= 7.0.0) verwenden, m&uuml;ssen Sie das kostenlose <em>Update auf 7.0.1</em> installieren, um die WebYep-Dreamweaver-Erweiterung verwenden zu k&ouml;nnen (dies w&auml;re aber ohnehin ratsam). </p>
      <p>Damit WebYep in Ihrer Website funktionieren kann, muss der Webspace-
        bzw. Internetprovider, bei dem Ihre Website deponiert ist, lediglich
        die <em>Ausf&uuml;hrung
        von PHP-Skripten</em> (PHP ab Version 4.1) erm&ouml;glichen. Eine <em>Datenbank</em> (wie
        zB. MySQL) ist f&uuml;r den Betrieb von WebYep <em>nicht erforderlich!</em></p>
      <h2>Zusammenfassung:</h2>
      <p>Systemvoraussetzungen am eigenen PC/Mac:</p>
      <ul>
        <li>Keine</li>
        <li>Wenn Sie Dreamweaver<span class="registered">&reg;</span> (mind. Version MX) unter Windows oder MacOS verwenden, k&ouml;nnen
        Sie die Dreamweaver-WebYep-Erweiterung einsetzen.</li>
      </ul>
      <p>Systemvoraussetzungen beim Webspace/Internet-Provider:</p>
      <ul>
        <li>Ausf&uuml;hrung von PHP-Skripten (mind. PHP Version 4.1)
          <ul>
            <li><small>Es muss sich um eine vollwertige, dem Stand der Technik entsprechende
                PHP-Unterst&uuml;tzung handeln.</small></li>
            <li><small>WebServer unter Windows werden grunds&auml;tzlich unterst&uuml;tzt,
                sind aber oft problematisch.</small></li>
            <li><small>Es muss m&ouml;glich sein, PHP Datei-Schreibrechte auf
                einen bestimmten Ordner zu geben.</small></li>
          </ul>
        </li>
        <li>Keine Datenbank erforderlich!</li>
      </ul>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Eigenes Logo  (white label) <!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>Sie k&ouml;nnen, die entsprechende WebYep-Lizenz vorausgesetzt, WebYep als Ihr eigenes Produkt darstellen, mit eigener Produktbezeichnung und eigenem Logo.</p>
      <p>Normalerweise ist es zwar erlaubt, grafische Bestandteile von WebYep (wie Grafiken und das Stylesheet) abzu&auml;ndern, um WebYep optisch an eine eigene Website anzupassen. Das &Auml;ndern des WebYep Logos und entfernen der Hinweise auf den Hersteller (Objective Development Software GmbH) ist aber nicht erlaubt. </p>
      <p>Durch Erwerben einer WebYep-Lizenz mit &quot;white label&quot; Option, erwerben Sie  das Recht f&uuml;r eine bestimmte Domain (Website), auch diese &Auml;nderungen an WebYep vorzunehmen. Sie erhalten dann einen speziellen Lizenzcode, mit dem diese Option in WebYep freigeschalten wird. </p>
      <h2>Wie wird WebYep zu Ihrem eigenen Produkt?</h2>
      <p>Um WebYep nun als eigenes Produkt mit Ihrer eigenen Corporate Identity bzw. Ihrem Corporate Design zu versehen, k&ouml;nnen Sie folgende &Auml;nderungen vornehmen:</p>
      <h3>WebYep Logo </h3>
      <p>&Auml;ndern Sie das WebYep Logo: Die Datei <span class="codeExample">logo.gif</span> im Unterordner &quot;<span class="codeExample">programm/images</span>&quot; des webyep-system Ordners. </p>
      <h3>Bedienelemente, Kn&ouml;pfe, etc.</h3>
      <p>Im Unterordner &quot;<span class="codeExample">programm/images</span>&quot; des webyep-system Ordners finden Sie auch diverse andere Grafiken, die Sie an Ihr Design anpassen k&ouml;nnen.</p>
      <h3>Schriftarten, Farben, etc. </h3>
      <p>Im Unterordner &quot;<span class="codeExample">programm</span>&quot; des webyep-system Ordners finden Sie die Datei <span class="codeExample">styles.css</span>, in der alle CSS Stildefinitionen von WebYep enthalten sind. Hier k&ouml;nnen Sie Schriftarten, Farben etc. anpassen.</p>
      <h3>Produktname </h3>
      <p>Um den Produktnamen  anzupassen, &ouml;ffnen Sie die Konfigurationdatei <span class="codeExample">konfiguration.php</span> im webyep-system Ordner. Dort finden Sie den Eintrag</p>
      <blockquote class="codeExample">  $webyep_sProductName = 'MyProduct';</blockquote>
      <p>&Auml;ndern Sie  den Text zwischen den einfachen Anf&uuml;hrungszeichen (<span class="codeExample">'</span>) entprechend ab. Achten Sie darauf, die umschlie&szlig;enden einfachen Anf&uuml;hrungszeichen intakt zu lassen und im Text keine solchen Zeichen zu verwenden!</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>Um Ihr modifiziertes WebYep System zu verwenden, benötigen Sie eine WebYep Lizenz mit White Label Option fuer den Hostnamen (Domain, URL), auf dem das System laufen soll.</p>
      <p>Zu <strong>Testzwecken</strong> und während der <strong>Entwicklung</strong> der Website, wird WebYep ueblicherweise mit einem lokalen Web-Server (auf Ihrem Arbeitsplatz-Rechner oder einem Server in Ihrem lokalen Netzwerk) betrieben. Wenn dieser Web-Server vom Internet aus <strong>nicht</strong> zugänglich ist (eine lokale IP-Adresse hat), benöten Sie fuer den Betrieb der modifizierten WebYep Version keine Lizenz mit White Label Option.</p>
      <p>Wenn Sie aber Ihr modifiziertes WebYep System auf einem öffentlichen Web-Server installieren, muessen Sie auch eine WebYep Lizenz mit White Label Option installieren, die zu dem Hostnamen passt, unter dem die Website angesprochen wird.</p>

      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<div align="center"><img src="images/logo-print.gif" width="384" height="181"></div>
<div align="center" style="font-size: 32px; font-weight: bold">Tutorials</div>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Tutorials<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>Hier finden Sie einige Anwendungsbeispiele von WebYep, anhand derer
        Sie Sich mit dem <em>Einsatz von WebYep vertraut machen</em> k&ouml;nnen.
        Die Tutorials gehen von der Verwendung von WebYep mittels Dreamweaver
        und der <em>WebYep
        Dreamweaver Extension</em> aus. Im Prinzip k&ouml;nnen Sie die Tutorials
        aber auch nachvollziehen, wenn Sie die WebYep-Elemente von Hand in den
        HTML-Code
        platzieren.</p>
      <div class="importantHeading">Wichtige Hinweise zum Dreamweaver:</div>
      <h2>Objektpalette:</h2>
      <p>In der  WebYep-Objektpalette finden Sie alle WebYep-Elemente, um Sie
      in die Seite einzuf&uuml;gen:</p>
      <p>        <img src="pictures/pallette-selection.gif" width="425" height="236"></p>
      <h2>Alle unsichtbaren Elemente einblenden</h2>
      <p>Da die WebYep-Elemente aus kleinen PHP-Code-Fragmenten bestehen, k&ouml;nnen Sie sie sichtbar machen, in dem Sie die unsichtbaren Elemente einblenden:</p>
      <p>Im Men&uuml; &quot;Bearbeiten&quot;, Men&uuml;punkt &quot;Voreinstellungen...&quot;,
        Kategorie &quot;Unsichtbare Elemente&quot; sollten Sie bei allen Elementen das
        H&auml;kchen setzen.</p>
      <p>Die WebYep-Elemente sollten in den Dokumenten im Dreamweaver dann ca. so aussehen:
      </p>
      <blockquote>
        <p><img src="pictures/php.gif" width="17" height="15"></p>
      </blockquote>
      <p>  Sie k&ouml;nnen  mit &quot;Ansicht&quot; / &quot;Visuelle Hilfsmittel&quot;
        / &quot;Alle ausblenden&quot; die WebYep-Elemente ein- und ausblenden.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>Um die Einf&uuml;gemarke im Dreamweaver exakt zu positionieren, dient
        der am unteren Fensterrand befindliche &quot;Tag-Selektor&quot;.</p>
      <p align="center"><img src="pictures/tag-selector.gif" width="314" height="131"></p>
      <p>Durch Klicken auf einen im Tag-Selektor gelisteten Tag wird dieser gesamte
        Tag im Dokument selektiert. Dr&uuml;cken Sie danach die &quot;Pfeil-Links&quot;- oder &quot;Pfeil-Rechts&quot;-Taste
        (cursor left/right) auf der Tastatur, dann wird die Einf&uuml;gemarke <em>exakt</em> vor
        bzw. nach diesen Tag gesetzt! </p>
      <h2>Zuweisen von CSS Stilen</h2>
      <p>Mit dem Tag-Selektor k&ouml;nnen einzelnen Tags auch CSS Stile gezielt zugeordnet werden:</p>
      <p>Setzen Sie dazu die Einf&uuml;gemarke in den Bereich, dem Sie einen Stil zuweisen m&ouml;chten. Im Tag-Selektor werden daraufhin alle beteiligten Tags gelistet.</p>
      <p>Klicken Sie nun im Tag-Selektor mit der <em>rechten Maustaste</em> auf
        den gew&uuml;nschten Tag und w&auml;hlen Sie im erscheinenden Kontext-Men&uuml; unter &quot;Klasse
        einrichten&quot; den
        gew&uuml;nschten Stil. </p>
      <p align="center"><img src="pictures/assign-css-stile.gif" width="270" height="172"></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Erste Schritte <!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p class="small hideFromPrint">&lt;<a href="javascript:window.print();">drucken</a>&gt;</p>
      <p>In diesem Tutorial lernen Sie die grundlegenden WebYep-Elemente kennen,
        wenden Sie in einer Beispielseite an und installieren diese am Webserver.</p>
      <p>Verwenden Sie f&uuml;r dieses Tutorial eine WebSite in der Sie WebYep
        installiert haben.</p>
      <h3>Anlegen der Seite, Einf&uuml;gen der Elemente</h3>
      <p>1. Erstellen Sie eine neue Seite &quot;wy-test.php&quot;</p>
      <p>2. F&uuml;gen Sie drei leere Abs&auml;tze ein.</p>
      <p>3. Setzen Sie die Einf&uuml;gemarke in die erste Zeile.</p>
      <p>4. Klicken Sie in der Dreamweaver Objektpalette (Kategorie &quot;WebYep&quot;)
        das WebYep Kurztext-Element (zweites von links) und f&uuml;gen Sie es so in
        die Seite ein.</p>
      <p>5. Setzen Sie die Einf&uuml;gemarke in die zweite Zeile.</p>
      <p>6. F&uuml;gen Sie direkt nacheinander aus der Objektpalette erst ein WebYep
        Bild-Element (viertes von links) und dann ein Text-Element (drittes von
        links) ein.</p>
      <p>7. Setzen Sie die Einf&uuml;gemarke in die dritte Zeile.</p>
      <p>8. F&uuml;gen Sie aus der Objektpalette einen WebYep Anmeldeknopf ein.</p>
      <p>In der Seite sollten nun vier WebYep-Elemente in Form kleiner gelber
        Icons sichtbar sein (stellen Sie sicher, dass Sie die &quot;Unsichtbaren
        Elemente&quot;
        alle eingeblendet haben - siehe <a href="index.html">Einleitung</a>):</p>
      <p align="center"><img src="pictures/tutorials/first-steps-1.gif" width="116" height="129"></p>
		<h3 class="pageBreak">Konfigurieren der Elemente</h3>
      <p>1. Klicken Sie auf das  WebYep-Element in der ersten Zeile, den
      Kurztext.</p>
      <p>2. Im Eigenschaftsfenster (Inspector) erscheinen die Eigenschaften des
        Kurztext-Elementes (siehe <a href="../reference/short-text.html">Referenz</a>).</p>
      <p>3. Geben Sie im Eigenschaftsfenster  als Feldname &quot;Titel&quot; ein.</p>
      <p>4. Klicken Sie auf das erste WebYep-Element in der zweiten Zeile, das
        Bild-Element.</p>
      <p>5. Geben Sie als Bildname &quot;Foto&quot; ein. Geben als HTML-Attribute folgendes
        ein:</p>
      <blockquote>
        <p class="codeExample">align=&quot;left&quot; hspace=&quot;20&quot;</p>
      </blockquote>
      <p>6. Klicken Sie auf das zweite WebYep-Element in der zweiten Zeile, das
        Text-Element.</p>
      <p>7. Geben Sie als Feldname &quot;Text&quot; ein.</p>
		<!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>Stellen Sie sicher, dass Sie den webyep-system Ordner auch zum WebServer
        &uuml;bertragen  und WebYep aktiviert haben (siehe &quot;<a href="../installation.html">Installation</a>&quot;).</p>
      <p>1. &Uuml;berspielen Sie die Seite auf den WebServer (Upload per FTP).</p>
      <p>2. Rufen Sie die Seite im WebBrowser auf, indem Sie den entsprechenden
        URL eingeben - z.B:</p>
      <blockquote>
        <p>http://www.meinewebsite.com/wy-test.php</p>
      </blockquote>
      <p align="center"><img src="pictures/tutorials/first-steps-2.gif" width="174" height="159"></p>
      <p>3. Klicken Sie auf das Schloss-Symbol (den WebYep-Anmeldeknopf).</p>
      <p>4. Geben Sie im erscheinenden Fenster den <em>Benutzernamen und das
          Kennwort</em>        ein, dass Sie bei der Installation von WebYep in der Datei konfiguration.php
        (im webyep-system Ordner) angegeben haben - von Haus aus lautet der Benutzername
        &quot;admin&quot; und das Kennwort ist leer.</p>
      <p align="center"><img src="pictures/tutorials/first-steps-3.gif" width="174" height="159"></p>
      <p>5. Klicken Sie auf die erscheinenden Bleistift-Symbole (die Editieren-Kn&ouml;pfe),
        um die Inhalte zu bearbeiten.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Das Men&uuml;<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p class="small hideFromPrint">&lt;<a href="javascript:window.print();">drucken</a>&gt;</p>
      <p>In diesem Tutorial lernen Sie den Umgang mit dem WebYep Men&uuml;-Element.</p>
      <p>Verwenden Sie f&uuml;r dieses Tutorial eine WebSite, in der Sie WebYep
        installiert haben!</p>
      <h3>Anlegen der Seite, Einf&uuml;gen der Elemente</h3>
      <p>1. Erstellen Sie eine neue Seite &quot;wy-menue.php&quot;. Arbeiten
        Sie nicht in einem unbenannten Dokument - speichern Sie die Datei wirklich
        gleich unter dem Namen &quot;wy-menue.php&quot;. </p>
      <p>2. F&uuml;gen Sie zwei leere Abs&auml;tze ein.</p>
      <p>3. Setzen Sie die Einf&uuml;gemarke in die erste Zeile.</p>
      <p>4. F&uuml;gen Sie aus der Objektpalette  (Kategorie &quot;WebYep&quot;) einen WebYep Anmeldeknopf ein.</p>
      <p>5. Setzen Sie die Einf&uuml;gemarke in die zweite Zeile.</p>
      <p>6. F&uuml;gen Sie eine Tabelle ein, bestehend aus einer Zeile und zwei Spalten mit 10 Pixel Zellauff&uuml;llung. </p>
      <p>Ihre Seite sollte nun ca. so aussehen (stellen Sie sicher, dass Sie die &quot;Unsichtbaren Elemente&quot; alle eingeblendet haben - siehe <a href="index.html">Einleitung</a>):</p>
      <p align="center"><img src="pictures/tutorials/simple-menu-1.gif" width="441" height="142"></p>
      <p>7. Setzen Sie die Einf&uuml;gemarke in die linke Spalte der Tabelle.</p>
      <p>8. F&uuml;gen Sie aus der Objektpalette (Kategorie &quot;WebYep&quot;) ein WebYep Men&uuml;-Element (f&uuml;nftes von links) ein.</p>
      <p>9. Setzen Sie die Einf&uuml;gemarke in die rechte Spalte der Tabelle. </p>
      <p>10. F&uuml;gen Sie zwei leere Abs&auml;tze ein.</p>
      <p>11. Setzen Sie die Einf&uuml;gemarke in die erste dieser Zeilen.</p>
      <p>12. Stellen Sie im Eigenschaftsfenster als Absatzformat &quot;&Uuml;berschrift 3&quot; ein.</p>
      <p>13. F&uuml;gen Sie aus der Objektpalette ein WebYep Kurztext-Element (zweites von links) ein. </p>
      <p>14. Setzen Sie die Einf&uuml;gemarke in die zweite  Zeile der rechten Tabellenspalte.</p>
      <p>15. F&uuml;gen Sie aus der Objektpalette ein WebYep Text-Element (drittes von links) ein. </p>
      <p>Ihre Seite sollte nun ca. so aussehen:</p>
      <p align="center"><img src="pictures/tutorials/simple-menu-2.gif" width="578" height="160"></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><h3 class="pageBreak">Konfigurieren der Elemente</h3>
      <p>1. Klicken Sie auf das WebYep Element in der linken Tabellenspalte (das Men&uuml;-Element)</p>
      <p>2. Geben Sie im Eigenschaftsfenster als Men&uuml;name &quot;Produkte&quot; ein. Unter &quot;Seite (URL)&quot; sollte &quot;wy-menue.php&quot; stehen.</p>
      <p>3. Klicken Sie auf das obere WebYep Element in der rechten Tabellenspalte (das Kurztext-Element).</p>
      <p>4. Geben Sie im Eigenschaftsfenster als Feldnamen &quot;Titel&quot; ein.</p>
      <p>5. Klicken Sie auf das untere WebYep Element in der rechten Tabellenspalte (das Text-Element).</p>
      <p>6. Geben Sie als Feldnamen &quot;Text&quot; ein.   </p>
      <h3 class="pageBreak">Testen der Seite</h3>
      <p>Stellen Sie sicher, dass Sie den webyep-system Ordner auch zum WebServer &uuml;bertragen und WebYep aktiviert haben (siehe &quot;<a href="../installation.html">Installation</a>&quot;).</p>
      <p>1. &Uuml;berspielen Sie die Seite auf den WebServer (Upload per FTP).</p>
      <p>2. Rufen Sie die Seite im WebBrowser auf, indem Sie den entsprechenden URL eingeben - z.B:</p>
      <blockquote>
        <p>http://www.meinewebsite.com/wy-menue.php</p>
      </blockquote>
      <p align="center"><img src="pictures/tutorials/first-steps-2.gif" width="174" height="159"></p>
      <p>3. Klicken Sie auf das Schloss-Symbol (den WebYep-Anmeldeknopf).</p>
      <p>4. Geben Sie im erscheinenden Fenster den <em>Benutzernamen und das Kennwort</em> ein, dass Sie bei der Installation von WebYep in der Datei konfiguration.php (im webyep-system Ordner) angegeben haben - von Haus aus lautet der Benutzername &quot;admin&quot; und das Kennwort ist leer.</p>
      <p align="center"><img src="pictures/tutorials/simple-menu-4.gif" width="461" height="205"></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><p>5. Klicken Sie auf das erscheinende Bleistift-Symbol (den Editieren-Knopf) neben dem Wort &quot;Produkte&quot;, um das Men&uuml; zu bearbeiten.</p>
      <p>6. Es erscheint das Men&uuml;-Editor-Fenster (siehe &quot;<a href="../reference/menu.html">Referenz / Men&uuml;</a>&quot;) </p>
      <p>7. Legen Sie im Men&uuml;-Editor-Fenster drei Men&uuml;punkte an, indem
        Sie die Bezeichnungen (zB. &quot;&Auml;pfel&quot;, &quot;Birnen&quot; und &quot;Zitronen&quot;)
        in das Texteingabefeld eintippen und anschlie&szlig;en auf &quot;hinzuf&uuml;gen&quot; klicken.</p>
      <p align="center"><img src="pictures/tutorials/simple-menu-5.gif" width="368" height="140"></p>
      <p>8. Speichern Sie das Men&uuml; durch Klick auf &quot;Speichern&quot;. </p>
      <p align="center"><img src="pictures/tutorials/simple-menu-6.gif" width="397" height="185"></p>
      <p>9. Klicken Sie auf einen der Men&uuml;punkte.</p>
      <p>10. Geben Sie Titel und Text (durch Klicken auf die jeweiligen Bleistift-Symbole) ein.</p>
      <!-- #BeginLibraryItem "/Library/webyep_di.lbi" --><div class="remark">
        <p><span class="remarkHeading">Hinweis:</span> Sie k&ouml;nnen einen Men&uuml;punkt auch direkt mit einem Link von einer anderen Seite aus anspringen, indem
          Sie beim Link an den URL
          folgendes
          anh&auml;ngen:</p>
        <blockquote>
          <p class="codeExample">?WEBYEP_DI=x</p>
        </blockquote>
        <p>wobei &quot;x&quot; f&uuml;r die Identifikations-Nummer des Men&uuml;eintrages steht - also zB.:</p>
        <blockquote>
          <p class="codeExample">eine_seite_mit_menue.php?WEBYEP_DI=1</p>
        </blockquote>
        <p>Sie k&ouml;nnen die Identifikations-Nummer eines Men&uuml;eintrages leicht herausfinden, indem Sie den Men&uuml;eintrag im WebBrowser einfach anklicken und so die entsprechende Unterseite aufrufen - dann sehen Sie in der URL-Zeile (Adress-Zeile) des WebBrowsers den URL der Seite mit oben erw&auml;hntem &quot;<span class="codeExample">?WEBYEP_DI=...</span>&quot;. </p>
        </div>
<!-- #EndLibraryItem --><!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><!-- InstanceEndEditable -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Die Schleife <!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p class="small hideFromPrint">&lt;<a href="javascript:window.print();">drucken</a>&gt;</p>
      <p>In diesem Tutorial lernen Sie den Umgang mit dem WebYep Schleifen-Element.</p>
      <p>Verwenden Sie f&uuml;r dieses Tutorial eine WebSite in der Sie WebYep
        installiert haben!</p>
      <h3>Anlegen der Seite, Einf&uuml;gen der Elemente</h3>
      <p>1. Erstellen Sie eine neue Seite &quot;wy-schleife.php&quot;. Arbeiten Sie nicht in einem unbenannten Dokument - speicher Sie die Datei wirklich gleich unter dem Namen &quot;wy-schleife.php&quot;. </p>
      <p>2. F&uuml;gen Sie zwei leere Abs&auml;tze ein.</p>
      <p>3. Setzen Sie die Einf&uuml;gemarke in die erste Zeile.</p>
      <p>4. F&uuml;gen Sie aus der Objektpalette  (Kategorie &quot;WebYep&quot;) einen WebYep Anmeldeknopf ein.</p>
      <p>5. Setzen Sie die Einf&uuml;gemarke in die zweite Zeile.</p>
      <p>6. F&uuml;gen Sie aus der Objektpalette erst ein WebYep Bild-Element
        (viertes von links) und dann ein WebYep Kurztext-Element (zweites von
        links) ein. </p>
      <p>Ihre Seite sollte nun ca. so aussehen (stellen Sie sicher, dass Sie die &quot;Unsichtbaren Elemente&quot; alle eingeblendet haben - siehe <a href="index.html">Einleitung</a>):</p>
      <p align="center"><img src="pictures/tutorials/loop-1.gif" width="134" height="107"></p>
      <p>7. Die Einf&uuml;gemarkte sollte nun in der zweiten Zeile stehen. </p>
      <p>8. Selektieren Sie den ganzen Absatz, indem Sie im Tag-Selektor auf den &lt;p&gt;-Tag klicken:</p>
      <p align="center"><img src="pictures/tutorials/loop-2.gif" width="177" height="152"></p>
      <p>9. Dr&uuml;cken Sie nun auf der Tastatur die &quot;Pfeil nach <em>links</em>&quot;-Taste
        (cursor left) - damit steht die Einf&uuml;gemarke <em>exakt vor</em> dem
        zweiten Absatz (siehe auch &quot;<a href="index.html#positioning">Positionierung
        im Dokument</a>&quot; in der Einleitung zu den Tutorials). </p>
      <p>10. F&uuml;gen Sie nun aus der Objektpalette das WebYep Schleife/Start-Element
        ein (drittes von rechts).</p>
      <p>11. Setzen Sie nun die Einf&uuml;gemarke <em>exakt nach</em> den Absatz
        (mit der vorhin beschriebenen Methode).</p>
      <p>12. F&uuml;gen Sie nun aus der Objektpalette das WebYep Schleife/Ende-Element
        ein (zweites Element von rechts in der Palette).</p>
      <p>Ihre Seite sollte nun ca. so aussehen:</p>
      <p align="center"><img src="pictures/tutorials/loop-3.gif" width="160" height="184"></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p>1. Klicken Sie auf das WebYep Element in der zweiten Zeile (das Schleife/Start-Element)</p>
      <p>2. Geben Sie im Eigenschaftsfenster als Bezeichnung &quot;Angebote&quot; ein.</p>
      <p>3. Klicken Sie auf das linke WebYep Element in der dritten Zeile (das Bild-Element).</p>
      <p>4. Geben Sie im Eigenschaftsfenster als Bildnamen &quot;Foto&quot; ein.
        Geben Sie als HTML-Attribute folgendes ein:</p>
      <blockquote>
        <p class="codeExample">align=&quot;left&quot;</p>
      </blockquote>
      <p>5. Klicken Sie auf das rechte WebYep Element in der dritten Zeile (das
        Kurztext-Element).</p>
      <p>6. Geben Sie im Eigenschaftsfenster als Feldnamen &quot;Text&quot; ein.</p>
      <h3 class="pageBreak">Testen der Seite</h3>
      <p>Stellen Sie sicher, dass Sie den webyep-system Ordner auch zum WebServer &uuml;bertragen und WebYep aktiviert haben (siehe &quot;<a href="../installation.html">Installation</a>&quot;).</p>
      <p>1. &Uuml;berspielen Sie die Seite auf den WebServer (Upload per FTP).</p>
      <p>2. Rufen Sie die Seite im WebBrowser auf, indem Sie den entsprechenden URL eingeben - z.B:</p>
      <blockquote>
        <p>http://www.meinewebsite.com/wy-schleife.php</p>
      </blockquote>
      <p align="center"><img src="pictures/tutorials/first-steps-2.gif" width="174" height="159"></p>
      <p>3. Klicken Sie auf das Schloss-Symbol (den WebYep-Anmeldeknopf).</p>
      <p>4. Geben Sie im erscheinenden Fenster den <em>Benutzernamen und das Kennwort</em> ein, dass Sie bei der Installation von WebYep in der Datei konfiguration.php (im webyep-system Ordner) angegeben haben - von Haus aus lautet der Benutzername &quot;admin&quot; und das Kennwort ist leer.</p>
      <p align="center"><img src="pictures/tutorials/loop-4.gif" width="191" height="152"></p>
      <p>5. Klicken Sie auf die erscheinenden Bleistift-Symbole (die Editieren-Kn&ouml;pfe), um ein Foto hinaufzuladen und einen Text einzugeben.</p>
      <p>6. Klicken Sie auf das &quot;+&quot;-Symbol, um  Schleifen-Bl&ouml;cke hinzuzuf&uuml;gen.</p>
      <p align="center"><img src="pictures/tutorials/loop-5.gif" width="238" height="237"></p>
      <p>Klicken Sie das M&uuml;lleimer-Symbol um ganze Schleifen-Bl&ouml;cke zu l&ouml;schen,
        die &quot;Pfeil hinauf&quot;/&quot;Pfeil hinunter&quot;-Symbole um die Reihenfolge der Bl&ouml;cke
        zu &auml;ndern.</p>
      <p>In diesem Tutorial enth&auml;lt die Schleife nur WebYep Elemente. Das
        WebYep Schleifen-Element kann aber grunds&auml;tzlich beliebigen Inhalt
        haben: Jeglichen HTML-Code (Text, Bilder oder auch Tabellen) <em>und</em> WebYep
        Elemente.</p>
      <p><!-- #BeginLibraryItem "/Library/up.lbi" -->
      <!-- InstanceEndEditable -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<div align="center"><img src="images/logo-print.gif" width="384" height="181"></div>
<div align="center" style="font-size: 32px; font-weight: bold">Reference</div>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Referenz<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p>WebYep Elemente sind kurze PHP-Code-Fragmente, die in den HTML-Coder der Seite eingebettet werden. Im Dreamweaver<span class="registered">&reg;</span> k&ouml;nnen diese &uuml;ber die <em>Objektpalette</em>  in die Seiten eingef&uuml;gt werden.</p>
        <p>Aber Sie k&ouml;nnen die n&ouml;tigen PHP-Code-Fragmente auch mit jedem anderen HTML-Editor manuell in Ihre Seiten einf&uuml;gen &ndash; siehe dazu die Referenzen der einzelnen WebYep Elemente. </p>
      <p>Bitte beachten Sie, dass HTML-Seiten, die WebYep-Elemente beinhalten,
        die <em>Dateiendung &quot;.php&quot;</em> aufweisen m&uuml;ssen (nicht &quot;.htm&quot; oder &quot;.html&quot;)!</p>
      <hr size="1" noshade>
      <p> Nach Installation der WebYep Dreamweaver<span class="registered">&reg;</span> Extension finden Sie im Popupmen&uuml; am linken oberen Rand der Objektpalette  eine neue <em>Kategorie &quot;WebYep&quot;</em>:</p>
      <p align="center"><img src="pictures/pallette-selection.gif" width="425" height="236"></p>
      <p>Durch Klick auf eines der in der Objektpalette gelisteten Symbole wird
        das entsprechende WebYep-Element in die Seite eingef&uuml;gt:</p>
      <p>Das eingef&uuml;gte WebYep-Element wird durch ein <em>&quot;PHP&quot;-Symbol</em> in der Seite dargestellt - wenn dieses <em>selektiert</em> wird, werden im <em>Eigenschaftsfenster</em> (Men&uuml; &quot;Fenster / Eigenschaften&quot;) die Einstellungsm&ouml;glichkeiten des WebYep-Elementes angezeigt.</p>
      <p align="center"><img src="pictures/webyep-elements.gif" width="293" height="273"><br>
        <span class="picturetext">Im Dokument: Das eingef&uuml;gte WebYep-Element
      (&quot;PHP&quot;-Symbol)</span>      </p>
      <p align="center"><img src="pictures/image-inspector.gif" width="430" height="106"><br>
        <span class="picturetext">Das Eigenschaftsfenster mit den Einstellungsm&ouml;glichkeiten
      f&uuml;r ein WebYep-Element</span></p>
      <p class="remark"><span class="remarkHeading">Wichtiger Hinweis:</span> Stellen
        Sie sicher, dass Dreamweaver die <em>&quot;Unsichtbaren-Elemente&quot;</em> anzeigt:
        Men&uuml; &quot;Ansicht
        / Visuelle Hilfsmittel / Unsichtbare Elemente&quot; bzw.
        in den Voreinstellungen (Men&uuml; &quot;Bearbeiten / Voreinstellungen&quot;)
        unter Kategorie &quot;Unsichtbare Elemente&quot; die &quot;Server Markup
        Tags&quot; aktivieren.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p align="center"><img src="pictures/designing-elements.gif" width="379" height="337"><br>
          <span class="picturetext">Das WebYep-Element kann mit dem umliegenden Text einfach<br>
  mit formatiert werden (vorz&uuml;glich mittels CSS).</span></p>
      <p>&nbsp;</p>
      <h2>Zusammenfassung</h2>
      <ul>
        <li>Im Dreamweaver<span class="registered">&reg;</span> WebYep-Elemente werden durch Anklicken des gew&uuml;nschten Symbols in der Objektpalette (Kategorie &quot;WebYep&quot;) in die Seite eingef&uuml;gt.</li>
        <li>Die WebYep-Elemente werden im Dreamweaver<span class="registered">&reg;</span> durch kleine &quot;PHP&quot;-Symbole in der Seite dargestellt.</li>
        <li>Selektiert man dieses Symbol, so k&ouml;nnen im Eigenschaftsfenster die Einstellungen f&uuml;r das WebYep-Element vorgenommen werden.</li>
        <li>Die WebYep-Elemente k&ouml;nnen gestaltet/verschoben etc. werden wie herk&ouml;mmliche Texte oder Bilder</li>
      </ul>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Der WebYep Init Code <!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <div style="width: 600px">
        <p>Jede Seite, die WebYep Elemente beinhaltet, ben&ouml;tigt eine PHP-Code-Fragment, mit dem das WebYep System initialisiert wird. Dieses Code-Fragment muss <strong>vor allem anderen</strong> im Code der Seite platziert sein &ndash; nicht einmal eine Leerzeile darf dem Init Code vorangestellt sein.</p>
        <p>Der Init Code muss auch <strong>vor</strong> der &lt;DOCTYPE...-Direktive platziert sein. Obwohl diese Direktive eigentlich ebenfalls ganz am Beginn des Dokuments stehen muss, f&uuml;hrt dies <strong>nicht</strong> zu Problemen, weil das PHP-Code-Fragment bereits am Server abgearbeitet (und somit &quot;konsumiert&quot;) wird &ndash; im HTML-Code, der den Webbrowser erreicht, ist der PHP-Code nicht mehr vorhanden und somit die &lt;DOCTYPE&gt;-Direktive <strong>wieder ganz am Beginn</strong> des Dokuments.</p>
        <p>Der Init Code wird <strong>automatisch in das Dokument eingef&uuml;gt</strong>, wenn Sie eines der unterst&uuml;tzten WebDesign-Programme (wie zB. Dreamweaver) und das dazugeh&ouml;rige <strong>WebYep Plugin</strong> bzw. die <strong>WebYep Extension</strong> verwenden. Wenn Sie aber Ihre Seiten &quot;von Hand&quot; codieren oder zumindest die PHP-Code-Fragmente f&uuml;r die WebYep-Elemente manuell einf&uuml;gen, so ist auch der WebYep Init Code manuell einzuf&uuml;gen.</p>
        <p>Dies ist der WebYep Init Code:<br>
          (Bitte kopieren Sie den <strong>gesamten</strong> Code, vom ersten &quot;&lt;?php&quot; bis zum letzten &quot;?&gt;&quot;) </p>
      </div>
      <hr size="1" noshade>
        <pre>&lt;?php // WebYep init WebYepV1
/* &gt;&lt;table&gt;&lt;tr&gt;&lt;td bgcolor=white&gt;&lt;h2&gt;WebYep message: Error, PHP inactive&lt;/h2&gt;
&lt;font color=red&gt;The PHP code in this page can not be executed!&lt;ul&gt;
&lt;li&gt;Are you launching this page directly form your harddisc (e.g. via Dreamweavers
&quot;Preview in Browser&quot instead of accessing it via a webserver?&lt;/li&gt;
&lt;li&gt;Has this file the correct file extension for PHP scripts?
WebYep pages must have the &quot;.php&quot; extension and &lt;b&gt;not&lt;/b&gt; ".html" or ".htm"!&lt;/li&gt;
&lt;/ul&gt;&lt;/font&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;!--
*/
$webyep_sIncludePath = "./";
$iDepth = 0;
while (!file_exists($webyep_sIncludePath . "webyep-system")) {
	$iDepth++;
	if ($iDepth &gt; 10) {
		error_log("webyep-system folder not found!", 0);
		echo "&lt;html&gt;&lt;head&gt;&lt;title&gt;WebYep&lt;/title&gt;&lt;/head&gt;&lt;body&gt;&lt;b&gt;WebYep:&lt;/b&gt; This page can not be displayed &lt;br&gt;Problem: The webyep-system folder was not found!&lt;/body&gt;&lt;/html&gt;";
		exit;
	}
	$webyep_sIncludePath = ($webyep_sIncludePath == "./") ? ("../"):("$webyep_sIncludePath../");
}
if (file_exists("${webyep_sIncludePath}webyep-system/programm")) $webyep_sIncludePath .= "webyep-system/programm";
else $webyep_sIncludePath .= "webyep-system/program";
include("$webyep_sIncludePath/webyep.php");
// --&gt;?&gt;</pre><hr size="1" noshade>
      <h2>Zusammenfassung</h2>
      <div style="width: 600px">
        <ul>
          <li>Jede Seite, die WebYep-Elemente beinhaltet, ben&ouml;tigt auch den WebYep Init Code.</li>
          <li>Der Init Code muss <strong>ganz am Beginn</strong> des Dokument-Codes platziert sein.</li>
          <li>Wenn Sie eines der unterst&uuml;tzten WebDesign-Programme (wie zB. Dreamweaver) und das zugeh&ouml;rige <strong>Plugin bzw. die Extension f&uuml;r WebYep</strong> verwenden, wird der <strong>Init Code automatisch platziert</strong>.</li>
        </ul>
      </div>
      <div style="width: 600px"><!-- #BeginLibraryItem "/Library/up.lbi" -->
      <!-- #EndLibraryItem --></div>
      <!-- InstanceEndEditable -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Anmeldeknopf<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/logonbutton-palette.gif" width="224" height="32"><br>
      <span class="picturetext">Das Symbol f&uuml;r den Anmelde-Knopf in der Objektpalette </span></p>
      <p>Wenn die BenutzerInnen der Website eine Seite im Webbrowser bearbeiten wollen, m&uuml;ssen sie sich erst mittels <em>Name und Kennwort</em> anmelden: Durch Klick auf den an <em>beliebiger Stelle</em> einer Seite platzierten Anmeldeknopf, wird vom Webbrowser eine Eingabemaske f&uuml;r Name und Kennwort angezeigt. Erst nach erfolgreicher &Uuml;berpr&uuml;fung von Name und Kennwort wird die Seite im &quot;Bearbeiten&quot;-Modus angezeigt.</p>
      <p class="elementCodeHeading">Dieses WebYep Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php webyep_logonButton(true); ?&gt; <!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" -->
      <noscript>
      <div class="javaScriptWarning">Sie k&ouml;nnen die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript>
      <!-- #EndLibraryItem -->
      <div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">webyep_logonButton()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Anmeldeknopfes &quot; weiter unten)</span>
          <ol>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; gibt an, ob der Anmeldeknopf sichtbar sein soll. <br>
                <span class="codeExample">true</span> wenn er sichtbar sein soll. <br>
                <span class="codeExample">false</span> wenn nicht &ndash; der Anmeldeknopf ist dann aber immer noch vorhanden und kann angeklickt werden (wenn man wei&szlig;, wo er liegt).<br>
            Unabh&auml;ngig davon ist aber immer die Eingabe von Benutzername und Kennwort erforderlich!</li>
          </ol>
      </div>
      <p> Zur Konfiguration von Benutzername und Kennwort siehe auch das Kapitel &quot;<a href="../installation.html#configuration">WebYep konfigurieren</a>&quot;.</p>
      <p align="center"><img src="pictures/logonbutton-inpage.gif" width="353" height="304"><br>
      <span class="picturetext">Rechts unten der WebYep-Anmeldeknopf</span></p>
      <p>Der Anmeldeknopf kann, <em>aber muss nicht auf jeder bearbeitbaren
          Seite</em> einer Website platziert werden. Ein Anmeldeknopf auf einer
          Seite gen&uuml;gt - nach erfolgreicher Anmeldung sind alle Seiten bearbeitbar,
          da die Anmeldedaten mittels <em>Cookies</em> im Webbrowser (verschl&uuml;sselt)
          gespeichert werden. Personen, die Webseiten mittels WebYep bearbeiten
          wollen (BenutzerInnen), sollten
          daher in ihren Webbrowsern die Cookies nicht deaktivieren!</p>
      <p class="remark"><span class="remarkHeading">Technischer Hinweis:</span> Name
        und Kennwort werden in Cookies im Browser gespeichert, nicht aber auf
        der Festplatte, sondern nur im Arbeitsspeicher (Session-Cookie)! Das
        Kennwort wird dabei zus&auml;tzlich in Kombination mit dem aktuellen
        Datum verschl&uuml;sselt, sodass selbst im Falle eines &quot;Cookie-Diebstahls&quot; dieses
        Cookie nur einen Tag lang zum Bearbeiten der Seite berechtigen w&uuml;rde.
        Da die Eingabe im Logon-Formular aber von den Browsern unverschl&uuml;sselt &uuml;bertragen
        wird (au&szlig;er bei einer SSL-verschl&uuml;sselten Kommunikation via
        https), ist ein &quot;Abh&ouml;ren&quot; des Kennwortes theoretisch technisch denkbar. </p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p align="center"><img src="pictures/logonbutton-inspector.gif" width="406" height="107"><br>
          <span class="picturetext">Das Eigenschaftsfenster f&uuml;r den Anmeldeknopf</span></p>
      <h3>sichtbar</h3>
      <p>Wenn diese Option <em>deaktiviert</em> wird, dann versteckt WebYep das
        Schloss-Symbol - der Anmelde-Knopf ist somit unsichtbar. Die BenutzerInnen
      m&uuml;ssen dann den Platz des Anmeldeknopfes auf der Webseite kennen (zB.
      direkt unterhalb des Firmenlogos) - wenn sie mit der Maus an diese Stelle
      klicken, erfolgt wie gewohnt die Anmeldung.</p>
      <p>Das Ausblenden des Anmeldeknopfes macht das Anmelden zwar etwas zum Minensuchspiel, aber daf&uuml;r ist die Wahrscheinlichkeit, dass herk&ouml;mmliche BesucherInnen der Website mit dem Schloss-Symbol &quot;herumspielen&quot; und vielleicht versuchen das Kennwort zu erraten, weniger gro&szlig;...</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Kurztext<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/short-text-palette.gif" width="224" height="32"><br>
      <span class="picturetext">Das Symbol f&uuml;r das Kurztext-Element in der Objektpalette</span></p>
      <p>Das Kurztext-Element ist f&uuml;r <em>kurze Textpassagen</em> wie &Uuml;berschriften,
        Namen oder Produktpreise gedacht. Im Gegensatz zum Text-Element sind
        hier keine Formatierungen innerhalb des Textes m&ouml;glich. Um den Webserver
        nicht mit unn&ouml;tigen Berechnungen zu belasten, sollte dieses WebYep-Element
        dem Text-Element vorgezogen werden, wenn die F&auml;higkeiten des Text-Elementes
        nicht ben&ouml;tigt werden oder unerw&uuml;nscht sind.</p>
      <p class="elementCodeHeading">Dieses WebYep Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php webyep_shortText(&quot;Feldname&quot;, false); ?&gt; <!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" -->
      <noscript>
      <div class="javaScriptWarning">Sie k&ouml;nnen die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript>
      <!-- #EndLibraryItem -->
      <div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">webyep_shortText()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Kurztext-Elementes&quot; weiter unten)</span>
          <ol>
            <li> <span class="codeExample">&quot;Feldname&quot;</span>: Ein Text &ndash; der Name f&uuml;r dieses Element. </li>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; der G&uuml;ltigkeitsbereich dieses Elementes. <br>
                <span class="codeExample">true</span> wenn das Element in <em>allen</em> Seiten den selben Inhalt haben soll (global).<br>
                <span class="codeExample">false</span> wenn es auf jeder Seite, auf der es platziert ist, andere Inhalte haben soll.</li>
          </ol>
      </div>
      <p align="center"><img src="pictures/short-text-inpage.gif" width="345" height="363"><br>
          <span class="picturetext">Das Kurztext-Element in Aktion - durch Klicken auf den Bearbeiten-Knopf (&quot;Titel bearbeiten &quot;)<br>
&ouml;ffnet sich das Kurztext-Bearbeiten-Fenster</span></p>
      <p align="center"><img src="pictures/short-text-editor.gif" width="460" height="307"><br>
      <span class="picturetext"> Das Kurztext-Bearbeiten-Fenster</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p align="center"><img src="pictures/short-text-inspector.gif" width="422" height="107"><br>
      <span class="picturetext">Das Eigenschaftsfenster f&uuml;r das Kurztext-Element</span></p>
      <h3>Feldname</h3>
      <p>  Eine Bezeichnung f&uuml;r das Kurztext-Element. Der Feldname wird in der Webseite im &quot;Bearbeiten&quot;-Modus angezeigt, damit die BenutzerInnen bei der Eingabe die verschiedenen Kurztext-Elemente unterscheiden k&ouml;nnen.</p>
      <h3>Inhalte</h3>
      <p> 
  Ist hier &quot;in diesem Dokument&quot; eingestellt, so ist dieses Kurztext-Element
  von den Kurztext-Elementen <em>anderer Seiten</em> <em>unabh&auml;ngig</em>,
  auch wenn diese den <em>gleichen Feldnamen</em> aufweisen. Wenn Sie m&ouml;chten,
  dass die Kurztext-Elemente mit diesem Feldnamen auf <em>allen Seiten</em> den <em>gleichen
  Inhalt</em> aufweisen, ist dieses Popupmen&uuml; auf &quot;in allen Dokumenten&quot; zu
  setzen.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Flie&szlig;text<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/long-text-palette.gif" width="224" height="32"><br>
      <span class="picturetext">Das Symbol f&uuml;r das Text-Element in der Objektpalette</span></p>
      <p>Das Text-Element ist f&uuml;r <em>l&auml;ngere Textpassagen</em> gedacht - zB. Produktbeschreibungen oder auch ganze Webseiten. Wenn Sie also eine l&auml;ngere Textstelle einer Webseite bearbeitbar machen wollen, k&ouml;nnen Sie dieses WebYep-Element verwenden.</p>
      <p>Die Formatierungsm&ouml;glichkeiten des Text-Elementes sind limitiert (siehe auch weiter unten) &ndash; desshalb ist es besonders gut geeignet, wenn Sie als WebDesignerIn m&ouml;glichst viel Kontrolle &uuml;ber das Aussehen der Texte behalten wollen.</p>
      <p>Wenn Sie mehr Kontrolle &uuml;ber das Aussehen der Texte an die RedakteurInnen abgeben m&ouml;chten, ist das HTML-Text-Element besser geeignet.</p>
      <p class="elementCodeHeading">Dieses WebYep Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php webyep_longText(&quot;Feldname&quot;, false, &quot;&quot;, false); ?&gt; <!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" -->
      <noscript>
      <div class="javaScriptWarning">Sie k&ouml;nnen die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript>
      <!-- #EndLibraryItem -->
      <div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">webyep_longText()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Text-Elementes&quot; weiter unten)</span>
          <ol>
            <li> <span class="codeExample">&quot;Feldname&quot;</span>: Ein Text &ndash; der Name f&uuml;r dieses Element. </li>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; der G&uuml;ltigkeitsbereich dieses Elementes. <br>
                <span class="codeExample">true</span> wenn das Element in <em>allen</em> Seiten den selben Inhalt haben soll (global).<br>
                <span class="codeExample">false</span> wenn es auf jeder Seite, auf der es platziert ist, andere Inhalte haben soll.</li>
            <li><span class="codeExample">&quot;&quot;</span>: Ein Text &ndash; nicht mehr verwendet. Geben Sie einen Leertext (&quot;&quot;) an. </li>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; gibt an, ob E-Mail-Links im Text kodiert werden sollen. <br>
                <span class="codeExample">true</span> wenn E-Mail-Adressen im Text mittels JavaScript kodiert werden sollen.<br>
                <span class="codeExample">false</span> wenn sie als normaler HTML Code ausgegeben werden sollen.</li>
          </ol>
      </div>
      <p align="center"><img src="pictures/long-text-inpage.gif" width="342" height="258"><br>
          <span class="picturetext">Das Text-Element in Aktion - durch Klicken
          auf den Bearbeiten-Knopf (&quot;Beschreibung bearbeiten&quot;)<br>
&ouml;ffnet sich das Text-Bearbeiten-Fenster</span></p>
      <p align="center"><img src="pictures/long-text-editor.gif" width="530" height="508"><br>
      <span class="picturetext"> Das Text-Bearbeiten-Fenster</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
        Text von WebYep untersucht und interpretiert wird. <em>Bestimmte Zeichenfolgen</em> haben
        eine bestimmte <em>Formatierung</em> des Textes zur Folge:</p>
      <table border="0" cellspacing="0" cellpadding="6">
        <tr>
          <td align="left" valign="top" bgcolor="#CCCCCC"><p><b><font color="black">bei Eingabe von</font></b></p></td>
          <td align="left" valign="top" bgcolor="#CCCCCC"><p><font color="black"><b>erscheint in der Seite</b></font></p></td>
          <td align="left" valign="top" bgcolor="#CCCCCC"><p><font color="black"><b> sieht
                  zB. so aus:</b></font></p></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>http://www.test.com</p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>Der Text &quot;http://www.test.com&quot; als Link auf diese Website - es wird ein neues Browserfenster ge&ouml;ffnet! (<span class="codeExample">target=&quot;_blank&quot;</span>) </p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p><a href="http://www.test.com" target="_blank" class="externalLink">http://www.test.com</a></p></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>test@firma.com</p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>Der Text &quot;test@firma.com&quot; als Link auf diese <nobr>E-Mail</nobr>-Adresse (<span class="codeExample">mailto:test@firma.com</span>) </p>
            <p>Siehe auch <a href="#hidemaillinks">E-Mail-Links kodieren</a> weiter
              unten.</p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p><a href="mailto:test@firma.com" class="externalLink">test@firma.com</a></p></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p><nobr>&lt;LINK:andereseite.html&nbsp;</nobr>Zur
              anderen <nobr>Seite&gt;</nobr></p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>Der Text &quot;Zur anderen Seite&quot; als Link auf die Datei <i>andereseite.html</i> - es wird <em>kein</em> neues Browserfenster ge&ouml;ffnet! Es k&ouml;nnen auch vollst&auml;ndige URLs (inkl. &quot;http://...&quot;) angegeben werden.</p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p><a href="javascript:alert('Dieser Link wuerde auf eine andere Seite der WebSite fuehren.');" class="externalLink">Zur anderen Seite</a></p></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p><nobr>&lt;FETT</nobr> Ein dicker <nobr>Text&gt;</nobr></p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>Der Text &quot;Ein
              dicker Text&quot; in Fettschrift (mittels <span class="codeExample">&lt;strong&gt;</span>-Tag)</p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p><b>Ein dicker Text</b></p></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p><nobr>&lt;BEISPIEL</nobr> Ein Text in spezieller <nobr>Form&gt;</nobr></p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>Der Text &quot;Ein Text in spezieller Form&quot; in dem CSS-Stil &quot;BEISPIEL&quot; formatiert (mittels <span class="codeExample">&lt;span class=&quot;BEISPIEL&quot;&gt;</span>).</p>
              <p>Sie k&ouml;nnen in Ihren Webseiten beliebige CSS-Stile anlegen, die von den BenutzerInnen dann auf diese Art angewendet werden k&ouml;nnen.</p>
              <p>Bitte beachten Sie aber dabei, dass die Stilnamen <em>ausschlie&szlig;lich
                aus Gro&szlig;buchstaben</em> bestehen!</p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p><span class="styleExample">Ein Text in spezieller Form </span></p></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>---</p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>Eine horizontale
              Trennlinie. Die Zeichenfolge &quot;---&quot; muss dazu in einer
              eigenen Zeile stehen!</p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><hr width="200">
          </td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>* Erster Listenpunkt<br>
          ** Ein Unterpunkt<br> 
        * Zweiter Listenpunkt mit einem langen Text<br>
        * Dritter Listenpunkt <nobr></nobr></p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>Durch Voranstellen
              eines oder mehrerer Sterne (oder des Listen-Symbols) werden die Zeilen als Liste
              formatiert. Statt dem Punkt-Symbol kann bei der Anzeige auch ein
              Bild (zB. GIF oder JPG)
              verwendet werden - siehe &quot;<a href="#listformat">Listenformatierung</a>&quot; weiter
              unten. </p></td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><ul style="margin: 0; margin-left: 30px; padding: 0px">
              <li>Erster Listenpunkt
                <ul style="margin: 0; margin-left: 30px; padding: 0px">
                  <li>Ein Unterpunkt </li>
                </ul>
              </li>
              <li>Zweiter Listenpunkt mit einem langen Text</li>
              <li>Dritter Listenpunkt <nobr></nobr></li>
          </ul></td>
        </tr>
        <tr bgcolor="#FFFFFF">
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>+ Erster Listenpunkt<br>
      ++ Ein Unterpunkt<br>
      + Zweiter Listenpunkt mit einem langen Text<br>
      + Dritter Listenpunkt <nobr></nobr></p></td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><p>Durch Voranstellen eines oder mehrerer Plus-Zeichen werden die Zeilen als Aufz&auml;hlungs-Liste formatiert. Welche Art der Numerierung verwendet wird, kann &uuml;ber entsprechende CSS-Stile f&uuml;r den &lt;ol&gt;- und &lt;li&gt;-Tag im Stylesheet der Seite beeinflusst werden - siehe &quot;<a href="#listformat">Listenformatierung</a>&quot; weiter unten.</p>
          </td>
          <td align="left" valign="top" bgcolor="#EEEEEE"><ol style="list-style: upper-roman; margin: 0; margin-left: 30px; padding: 0px">
              <li>Erster Listenpunkt
                  <ol style="list-style: lower-roman; margin: 0; margin-left: 30px; padding: 0px">
                    <li>Ein&nbsp;Unterpunkt </li>
                  </ol>
              </li>
              <li>Zweiter Listenpunkt mit einem langen Text</li>
              <li>Dritter Listenpunkt <nobr></nobr></li>
          </ol></td>
        </tr>
        <tr>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>aaa | bbb | ccc<br>
      111 | 222 | 333<nobr></nobr></p>
          </td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><p>Durch verwenden
              des &quot;|&quot;-Symbols (links unten auf der Tastatur neben
              dem &quot;Y&quot;, dabei AltGr gedr&uuml;ckt halten), k&ouml;nnen
              einfache Tabellen erzeugt werden. Das &quot;|&quot;-Symbol dient
              dabei als Spalten-Trenner.</p>
              <p>Das Aussehen der Tabelle muss durch entsprechende CSS-Stile
                festgelegt werden - siehe &quot;<a href="#tableformat">Tabellenformatierung</a>&quot; weiter unten.</p>
          </td>
          <td align="left" valign="top" bgcolor="#FFFFFF"><table border="0" cellspacing="0" cellpadding="6">
              <tr>
                <td>aaa</td>
                <td>bbb</td>
                <td>ccc</td>
              </tr>
              <tr>
                <td>111</td>
                <td>222</td>
                <td>333</td>
              </tr>
            </table>
          </td>
        </tr>
      </table>
      <p>Die Formatierungsnotation &quot;<nobr><span class="codeExample">&lt;BEISPIEL</span></nobr><span class="codeExample"> Ein Text in
      spezieller <nobr>Form&gt;</nobr></span><nobr></nobr>&quot; setzt voraus, dass Sie <em>in
      der Seite einen CSS-Stil</em> namens &quot;<span class="codeExample">.BEISPIEL</span>&quot; definiert haben! Wichtig ist dabei, dass der
      Stilname nur aus Gro&szlig;buchstaben bestehen darf!</p>
      <h3>Platzierung des Text-Elementes</h3>
      <p>Beachten Sie bitte, dass das Text-Element au&szlig;er Text auch diversen
        HTML-Code generiert (wie horizontale Linien oder Listen &#8211; siehe
        n&auml;chster Absatz).
        Daher ist es wichtig <em>innerhalb welches HTML-Tags</em> sie das Text-Element
        platzieren!</p>
      <p>Am sichersten ist es, wenn Sie es in einen &lt;DIV&gt;-Tag platzieren.
          Problematisch kann hingegen zB. das Setzen in einen &lt;P&gt;-Tag (Absatz)
        werden, da Listen (&lt;UL&gt;) oder Linien (&lt;HR&gt;) in einem Absatz  laut
        HTML-Spezifikation
          nicht erlaubt sind.</p>
      <p>Um zu ermitteln, innerhalb welchen Tags sich ein WebYep Text-Element
        befindet, selektieren Sie es im Dreamweaver und betrachten Sie dann den
        Tag-Selektor (am linken unteren Fensterrand): Die Reihe von dort gelisteten
        Tags gibt an, in welche Tags das Element eingebettet ist. Lautet der
         letzte in der Reihe &lt;p&gt;, so sollten Sie diesen mit der rechten Maustaste
        anklicken, &quot;Tag bearbeiten&quot; w&auml;hlen und aus dem &lt;p&gt; ein &lt;div&gt; machen.</p>
      <h3> <a name="listformat">Listenformatierung</a></h3>
      <p>Listen (Bullet Lists) werden von WebYep durch die HTML-Tags &lt;ul&gt; und
        &lt;li&gt; realisiert. Somit kann durch Erstellen entsprechender CSS-Stile
        das Aussehen dieser Listen wie gewohnt beeinflusst werden.</p>
      <p>So k&ouml;nnen Sie zum Beispiel durch den Stil:</p>
      <blockquote class="codeExample">ul { list-style-position: outside; list-style-image:
        url(bullet.gif); }</blockquote>
      <p>eine Grafik (<span class="codeExample">bullet.gif</span>) als Symbol f&uuml;r die Listenpunkte definieren.
        Sie k&ouml;nnen
        einen derartigen Stil im Dreamweaver einfach erzeugen - legen Sie einen
        neuen
        Stil an:</p>
      <blockquote>Selektor-Typ: <em>Tag</em><br>
      Tag: <em>ul</em></blockquote>
      <p>und vergeben Sie in der Kategorie &quot;Liste&quot; die gew&uuml;nschten
        Eigenschaften (Listenpunkt-Bild, Position, etc.)</p>
      <p>Wenn Sie mit dem Stil nicht alle Listen in der Seite sondern nur die
        im Text-Element beeinflussen m&ouml;chten, stellen Sie dass Text-Element
        einfach in einen &lt;div&gt;-Tag, geben diesem eine CSS-Klasse (<span class="codeExample">class=&quot;klassenname&quot;</span>)
        und &auml;ndern den Namen des obigen Stils von &quot;<span class="codeExample">ul</span>&quot; in &quot;<span class="codeExample">.klassenname
        ul</span>&quot;.</p>
      <p>Um nur Listenpunkte einer bestimmten Ebene (Einr&uuml;ckung) zu beeinflussen, muss bei der Stildefinition nur der Tag-Name (das &quot;ul&quot;) entsprechend oft wiederholt werden: </p>
      <blockquote class="codeExample">.klassenname ul ul { .....; }</blockquote>
      <p>beeinflusst beispielsweise nur Punkte der zweiten Ebene und tiefer, nicht aber die Haupt-Punkte. </p>
      <p>Um die mittels &quot;+&quot; erzeugten <strong>Aufz&auml;hlungslisten</strong> zu beeinflussen, gilt obiges entsprechend f&uuml;r den &lt;ol&gt;-Tag statt den &lt;ul&gt;-Tag. </p>
      <h3><a name="tableformat" id="tableformat">Tabellenformatierung</a>
      </h3>
      <p>Um das Aussehen von in den Text eingebetteten Tabellen festzulegen,
        k&ouml;nnen ebenfalls entsprechende CSS-Stile erzeugt werden - zB.:</p>
      <blockquote class="codeExample">
table {
<blockquote>
	margin: 0px;<br>
	padding: 0px;<br>
	border-top: 1px solid black;<br>
	border-left: 1px solid black;
</blockquote>
}<br>
<br>
td {
<blockquote>
	margin: 0px;<br>
	padding: 6px;<br>
	border-bottom: 1px solid black;<br>
	border-right: 1px solid black;</blockquote>
}<br>
      </blockquote>
      <p>Wenn Sie mit den Stilen nicht alle Tabellen in der Seite sondern nur
        die im Text-Element beeinflussen m&ouml;chten, stellen Sie dass Text-Element
        einfach
        in einen &lt;div&gt;-Tag, geben diesem eine CSS-Klasse (<span class="codeExample">class=&quot;klassenname&quot;</span>)
        und &auml;ndern die Namen der obigen Stile von &quot;<span class="codeExample">table</span>&quot;
        in &quot;<span class="codeExample">.klassenname
          table</span>&quot; bzw. von &quot;<span class="codeExample">td</span>&quot;
          in &quot;<span class="codeExample">.klassenname
      td</span>&quot;.</p>
      <p><!-- #BeginLibraryItem "/Library/up.lbi" -->
      <h2>Eigenschaften des Text-Elementes</h2>
      <p align="center"><img src="pictures/long-text-inspector.gif" width="430" height="106"><br>
      <span class="picturetext">Das Eigenschaftsfenster f&uuml;r das Text-Element</span></p>
      <h3>Feldname</h3>
      <p>Eine Bezeichnung f&uuml;r das Text-Element. Der Feldname wird in der Webseite im &quot;Bearbeiten&quot;-Modus angezeigt, damit die BenutzerInnen bei der Eingabe die verschiedenen Text-Elemente unterscheiden k&ouml;nnen.</p>
      <h3>Inhalte</h3>
      <p> Ist hier &quot;in diesem Dokument&quot; eingestellt, so ist dieses
        Text-Element von den Text-Elementen <em>anderer Seiten</em> <em>unabh&auml;ngig</em>,
        auch wenn diese den <em>gleichen Feldnamen</em> aufweisen. Wenn Sie m&ouml;chten,
        dass die Text-Elemente mit diesem Feldnamen auf <em>allen Seiten</em> den <em>gleichen
        Inhalt</em> aufweisen, ist dieses Popupmen&uuml; auf &quot;in allen Dokumenten&quot; zu
        setzen.</p>
      <h3><a name="hidemaillinks">E-Mail-Links kodieren</a></h3>
      <p>E-Mail-Adressen, die von den BenutzerInnen in ein WebYep-Text-Element
        eingegeben werden, zeigt WebYep als E-Mail-Links in der Seite an.
        Dies k&ouml;nnte (zB. von SPAM-Spidern) dazu missbraucht werden, diese
        E-Mail-Adressen zum Zwecke des Versendens von <em>SPAMs</em> zu sammeln.</p>
      <p>Um das zu verhindern, k&ouml;nnen Sie diese Option auf &quot;Ja&quot; stellen - damit
        werden die eingegebenen E-Mail-Adressen weiter als Links dargestellt,
        aber mittels <em>JavaScript  verschl&uuml;sselt</em>, sodass sie kaum
        mehr missbraucht werden k&ouml;nnen.</p>
      <p>Da diese Verschl&uuml;sselung aber auf JavaScript basiert, k&ouml;nnen die E-Mail-Adressen
        bei den wenigen BesucherInnen der Website, die <em>JavaScript deaktiviert</em>        haben, nur in der Form:</p>
      <blockquote class="codeExample">name(_AT_)adresse.com</blockquote>
      <p>angezeigt werden.</p>
      <p><!-- #BeginLibraryItem "/Library/up.lbi" -->
      <!-- InstanceEndEditable -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Bild<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/image-palette.gif" width="224" height="32"><br>
      <span class="picturetext">Das Symbol f&uuml;r das Bild-Element in der Objektpalette </span></p>
      <p>Indem Sie statt eines herk&ouml;mmlichen Bildes ein WebYep-Bild-Element in einer Webseite platzieren, geben Sie den BenutzerInnen der Webseite die M&ouml;glichkeit, das Bild selbst (im Webbrowser) durch eigene GIF- oder JPEG-Dateien zu ersetzen. </p>
      <p class="elementCodeHeading">Dieses WebYep Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php webyep_image(&quot;Feldname&quot;, false, 'vspace=&quot;100&quot;', &quot;eine_andere_seite.php&quot;, &quot;andererFrame&quot;, 70, 90, true); ?&gt; <!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" -->
      <noscript>
      <div class="javaScriptWarning">Sie k&ouml;nnen die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript>
      <!-- #EndLibraryItem -->
      <div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">webyep_image()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Bild-Elementes&quot; weiter unten)</span>
          <ol>
            <li> <span class="codeExample">&quot;Feldname&quot;</span>: Ein Text &ndash; der Name f&uuml;r dieses Element. </li>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; der G&uuml;ltigkeitsbereich dieses Elementes. <br>
                <span class="codeExample">true</span> wenn das Element in <em>allen</em> Seiten den selben Inhalt haben soll (global).<br>
                <span class="codeExample">false</span> wenn es auf jeder Seite, auf der es platziert ist, andere Inhalte haben soll.</li>
            <li><span class="codeExample">'vspace=&quot;100&quot;'</span>: Ein Text (optional) &ndash; die HTML-Attribute f&uuml;r den <span class="codeExample">&lt;img&gt;</span>-Tag. <br>
      Kann mehrere Attribut/Wert-Paare enthalten - zB.: <span class="codeExample">'width=&quot;100&quot; align=&quot;left&quot;'</span>.<br>
      Vorsicht mit den Anf&uuml;hrungszeichen: Doppelte innen (f&uuml;r HTML), einfache au&szlig;en (f&uuml;r PHP)!</li>
            <li><span class="codeExample">&quot;eine_andere_seite.php&quot;</span>: Ein Text (optional) &ndash; der URL einer Seite, auf die das Bild verweisen soll (Link). Kann auch ein absoluter URL sein (http://...).<br>
      Wenn ein Leertext (&quot;&quot;) angegeben wird, ist das Bild initial kein Link, kann aber von den BenutzerInnen noch beim Editieren der Seite verlinkt werden. </li>
            <li><span class="codeExample">&quot;andererFrame&quot;</span>: Ein Text (optional) &ndash; der Name eines Frames (Rahmen), der ggf. f&uuml;r den Link als &quot;target&quot; (Ziel) fungieren soll.<br>
      Geben Sie einen Leertext (&quot;&quot;) ein, wenn Sie kein Frameset verwenden und die verlinkte Seite nicht in einem neuen Fenster ge&ouml;ffnet werden soll.<br>
      Geben Sie <span class="codeExample">&quot;_blank&quot;</span> an, um die verlinkte Seite in einem neuen Fenster zu &ouml;ffnen.</li>
            <li>70: Eine Zahl &ndash; die Breite des Bildes bzw. des Vorschaubildes, oder Null, wenn der Parameter ignoriert werden soll.</li>
            <li>90: Eine Zahl &ndash; die H&ouml;he des Bildes bzw. des Vorschaubildes, oder Null, wenn der Parameter ignoriert werden soll.</li>
            <li> <span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; gibt an, ob f&uuml;r das Bild ein Vorschaubild erzeugt werden soll.<br>
                <span class="codeExample">true</span>, wenn ein Vorschaubild erzeugt werden soll. Breite bzw. H&ouml;he des Vorschaubildes werden durch die obigen beiden Parameter definiert. Ein Klick auf das Vorschaubild im Webbrowser &ouml;ffnet dann das Original-Bild in einem Popup-Fenster.<br>
              <span class="codeExample">false</span>, wenn kein Vorschaubild berechnet werden soll. Die Parameter f&uuml;r Breite und H&ouml;he gelten dann f&uuml;r das Bild selbst, das in dieser Gr&ouml;&szlig;e dann direkt in der Seite angezeigt wird.</li>
          </ol>
          <p>Bitte beachten Sie auch die Details unter &quot;Eigenschaften des Bild-Elementes&quot; weiter unten bzgl. Gr&ouml;&szlig;enangaben und Vorschaubild-Erstellung!</p>
      </div>
      <p>Die Bilddateien k&ouml;nnen von den BenutzerInnen direkt im Webbrowser
          zum Webserver gesendet werden. Im WebYep Bild-&Auml;ndern-Fenster  wird
          im
          Webbrowser einfach eine GIF- oder JPEG-Datei ausgew&auml;hlt und
          durch Klick auf &quot;Speichern&quot; wird die Datei zum Webserver
          gesendet und von WebYep gespeichert.</p>
      <p align="center"><img src="pictures/image-inpage.gif" width="325" height="365"><br>
          <span class="picturetext">Das Bild-Element in Aktion - durch Klicken
          auf den Bearbeiten-Knopf (&quot;Foto bearbeiten&quot;)<br>
&ouml;ffnet sich das Bild-&Auml;ndern-Fenster</span></p>
      <p align="center"><img src="pictures/image-editor.gif" width="529" height="307"><br>
      <span class="picturetext"> Das Bild-&Auml;ndern-Fenster</span></p>
      <p>Die BenutzerInnen k&ouml;nnen im Bild-&Auml;ndern-Fenster auch den URL einer Seite angeben, auf die das Bild verlinken soll (wenn nicht ein Vorschaubild erstellt wurde oder der/die WebDesignerIn nicht schon einen URL vorgegeben hat). Zus&auml;tzlich kann auch der &quot;Alt&quot;-Text (der Wert f&uuml;r das &quot;alt&quot;-Attribut des &lt;img&gt;-Tags) angegeben werden.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <p align="center"><img src="pictures/image-inspector.gif" width="434" height="102"><br>
      <span class="picturetext">Das Eigenschaftsfenster f&uuml;r das Bild-Element</span></p>
      <h3>Bildname</h3>
      <p>  Ein Name f&uuml;r das Bild-Element. Der Bildname wird in der Webseite
        im &quot;Bearbeiten&quot;-Modus angezeigt, damit die BenutzerInnen bei
        der Eingabe die verschiedenen Bild-Elemente unterscheiden k&ouml;nnen.</p>
      <h3>Inhalte</h3>
      <p> 
  Ist hier &quot;in diesem Dokument&quot; eingestellt, so ist dieses Bild-Element
  von den Bild-Elementen <em>anderer Seiten</em> <em>unabh&auml;ngig</em>, auch
  wenn diese den <em>gleichen Bildnamen</em> aufweisen. Wenn Sie m&ouml;chten,
  dass die Bild-Elemente mit diesem Bildnamen auf <em>allen Seiten</em> den <em>gleichen
  Inhalt</em> aufweisen, ist dieses Popupmen&uuml; auf &quot;in allen Dokumenten&quot; zu
  setzen.</p>
      <h3>Vorschaubild</h3>
      <p>Ist diese Option aktiviert, dann wird ein Vorschaubild berechnet, dass anstelle des Originals in der Seite dargestellt wird. Die Gr&ouml;&szlig;e des Vorschaubildes wird durch die Eigenschaften H&ouml;he und/oder Breite bestimmt. Ein Klick auf dieses Vorschaubild im Webbrowser &ouml;ffnet dann das Originalbild ein einem Popup-Fenster.</p>
      <p>Ist die Option nicht aktiviert, so wird kein Vorschaubild berechnet und stattdessen das Originalbild auf die durch H&ouml;he und/oder Breite definierte Gr&ouml;&szlig;e verkleinert (wenn einer dieser Eigenschaften angegeben werden). Ein Klick auf das Bild im Webbrowser &ouml;ffnet dann auch kein Popup-Fenster.</p>
      <h3>Breite / H&ouml;he</h3>
      <p>Gibt die Breite bzw. H&ouml;he des Bildes oder des Vorschaubildes an (siehe Eigenschaft &quot;Vorschaubild&quot;). Wenn keine Gr&ouml;&szlig;en&auml;nderung am hochgeladenen Bild vorgenommen werden soll, k&ouml;nnen diese Eigenschaften leer gelassen werden.</p>
      <p>Wenn eine dieser Eigenschaften angegeben wird, sorgt WebYep daf&uuml;r, dass das Bild (bzw. das Vorschaubild) die angegebene Breite oder H&ouml;he nicht &uuml;berschreitet.</p>
      <p>Wenn beide Eigenschaften angegeben werden, wird das verkleinerte Bild (bzw. Vorschaubild) weder die angegebene H&ouml;he noch die angegebene Breite &uuml;berschreiten.</p>
      <p>Das Seitenverh&auml;ltnis des Bildes bleibt dabei immer unangetastet. </p>
      <p class="remark"><span class="remarkHeading">Hinweis:</span> Die Gr&ouml;&szlig;en&auml;nderung (Verkleinerung) des Bildes kann nur durchgef&uuml;hrt werden, wenn am Webserver die <strong>PHP-Erweiterung &quot;GD&quot;</strong> installiert ist. Wenn nicht, so wird im Bild-&Auml;ndern-Fenster ein Warnhinweis angezeigt und das Bild wird nur in den entsprechenden Dimensionen <strong>angezeigt</strong> aber nicht tats&auml;chlich umgerechnet (die <strong>Datenmenge</strong> bleibt also unver&auml;ndert). </p>
      <h3>HTML-Attribute</h3>
      <p>Hier k&ouml;nnen Sie alle f&uuml;r den HTML <span class="codeExample">&lt;img&gt;</span>-Tag zul&auml;ssigen Attribute angeben - diese werden dann zum <span class="codeExample">&lt;img&gt;</span>-Tag des Bild-Elementes hinzugef&uuml;gt.</p>
      <blockquote>
        <p>Beispiel:&nbsp;&nbsp;&nbsp;<span class="codeExample">align=&quot;left&quot; hspace=&quot;20&quot; </span></p>
      </blockquote>
      <p>Dadurch w&uuml;rde  der nachfolgende Text  das links stehende Bild umflie&szlig;en und der horizontale Abstand zum umflie&szlig;enden Text w&auml;re 20 Pixel.</p>
      <h3>Seite (URL)</h3>
      <p>Der URL (bzw. Dateiname) einer Seite, auf die beim Klick auf dieses
        Bild verwiesen werden soll. Dadurch wird dieses Bild-Element zum Link.</p>
      <p>Bei Verwendung dieser Option f&uuml;r Bild-Elemente die sich in einer Schleife
        (<a href="/Shared/WebYep/Help/deutsch/reference/loop.html">WebYep-Schleifen-Element</a>)
        befinden (um mehrere Bilder zB. untereinander darzustellen), verh&auml;lt
        sich der Bild-Link dann wie ein WebYep-Men&uuml;-Element: Die Seite auf die
        verwiesen wird kann unterschiedliche Inhalte aufweisen, je nachdem welches
        der Bilder in der Schleife angeklickt wurde. So kann mit Schleife und
        Bild ein grafisches Men&uuml; aufgebaut werden.</p>
      <h3>Ziel (frame) - bei Verwendungen von Rahmen (target frame)</h3>
      <p>Wenn die unter der Eigenschaft &quot;Seite (URL)&quot; angegebene Seite
        beim Klick auf das Bild in einem <em>anderen Rahmen</em> dargestellt
        werden soll, ist bei der Eigenschaft &quot;Ziel (frame)&quot; der Name
        des betreffenden Rahmens anzugeben.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Datei-Download<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/attachment-palette.gif" width="224" height="32"><br>
      <span class="picturetext">Das Symbol f&uuml;r das Datei-Download-Element
      in der Objektpalette</span></p>
      <p>Das Datei-Download-Element dient dazu, beliebige Dokumente in einer
        Webseite zum Download (Herunterladen) bereitzustellen. Das bereitgestellte
        Dokument wird durch einen Link (den Dateinamen) in der Seite zum Download
        angeboten.</p>
      <p class="elementCodeHeading">Dieses WebYep Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php webyep_attachment(&quot;Feldname&quot;); ?&gt;<!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" --><noscript>
      <div class="javaScriptWarning">Sie können die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript><!-- #EndLibraryItem --><div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">webyep_attachment()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Datei-Download-Elementes&quot; weiter unten)</span>
          <ol>
            <li> &quot;Feldname&quot;: Ein Text, der Name f&uuml;r dieses Element. </li>
          </ol>
      </div>
      <p>Bei einigen Dateitypen (zB. PDF-Dokumenten) versuchen manche Browser
        das Dokument direkt im Browserfenster darzustellen, statt es herunterzuladen.
        WebYep verhindert dies soweit m&ouml;glich, damit die Dateien unabh&auml;ngig von
        der Plugin-Ausstattung des Browser <em>wirklich heruntergeladen</em> und
        nicht angezeigt werden. Leider halten sich nicht alle Browser (zB. Safari
        bis mind. Version 1.2.3) an die beteiligten Internet-Standards und so
        kann es manchmal doch dazu kommen, dass das Dokument im Browser <em>angezeigt</em>        wird.</p>
      <h3>Dateigr&ouml;&szlig;e</h3>
      <p>Die Gr&ouml;&szlig;e der Datei ist durch zwei Faktoren begrenzt:</p>
      <p>1. Die PHP-Konfiguration des Webspace-Providers. Hier kann ein Gr&ouml;&szlig;enlimit
        f&uuml;r den Datei-Upload konfiguriert werden (&uuml;blicherweise mind. 2MB). Dieses
        Limit wird zur Information im Datei-Download-Bearbeiten-Fenster angezeigt
        (siehe
        unten).</p>
      <p>2. Die Geschwindigkeit der Internet-Verbindung. Dauert ein Upload einer
        Datei aufgrund ihrer Gr&ouml;&szlig;e und/oder der geringen Geschwindigkeit der
        Internet-Verbindung zu lange,
        so kann es zum Abbruch des Uploads (nicht des Downloads!) kommen. Das
        Problem tritt also beim Bereitstellen der Datei durch den/die BenutzerIn
        auf - nicht beim Herunterladen durch den/die BesucherIn der Website.
        Hier k&ouml;nnen keine genauen Angaben gemacht werden - aber im Allgemeinen
        sollten Dateien kleiner 2MB keine Probleme bereiten.</p>
      <p align="center"><img src="pictures/attachment-inpage.gif" width="503" height="405"><br>
          <span class="picturetext">Das Datei-Download-Element in Aktion.<br>
          Durch
          Klicken auf den Bearbeiten-Knopf (&quot;Datei bearbeiten&quot;)<br>
&ouml;ffnet sich das Datei-Download-Bearbeiten-Fenster</span></p>
      <p align="center"><img src="pictures/attachment-editor.gif" width="443" height="238"><br>
      <span class="picturetext"> Das Datei-Download-Bearbeiten-Fenster</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><h2>Eigenschaften des Datei-Download-Elementes</h2>
      <p align="center"><img src="pictures/attachment-inspector.gif" width="422" height="70"><br>
      <span class="picturetext">Das Eigenschaftsfenster f&uuml;r das Datei-Download-Element</span></p>
      <h3>Feldname</h3>
      <p>  Eine Bezeichnung f&uuml;r das Datei-Download-Element. Der Feldname
        wird in der Webseite im &quot;Bearbeiten&quot;-Modus angezeigt, damit
        die BenutzerInnen bei der Eingabe die verschiedenen Datei-Download-Elemente
        unterscheiden k&ouml;nnen.</p>
      <p>Als Link f&uuml;r den Download (auf den die BesucherInnen klicken k&ouml;nnen,
        um die Datei herunterzuladen) wird nicht diese Bezeichnung angezeigt,
        sondern der tats&auml;chliche Dateiname.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><!-- InstanceEndEditable -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Men&uuml;<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/menu-palette.gif" width="224" height="32"><br>
      <span class="picturetext">Das Symbol f&uuml;r das Men&uuml;-Element in der Objektpalette</span></p>
      <p>Um eine WebYep-Seite - wie zB. eine Produktinfoseite - mehrfach verwenden
        zu k&ouml;nnen (also zB. zur Pr&auml;sentation mehrerer Produkte), wird
        das WebYep-Men&uuml;-Element eingesetzt. Dadurch muss nicht f&uuml;r
        jedes Produkt eine eigene HTML-Seite erstellt werden - es gen&uuml;gt
        eine Seite, f&uuml;r die WebYep mit Hilfe des Men&uuml;-Elementes mehrere
        sogenannte &quot;Instanzen&quot; erzeugt. Somit kann <em>die selbe</em> WebYep-Seite
        mit verschiedenen Inhalten (f&uuml;r verschiedene Produkte) angef&uuml;llt
        werden und mit dem Men&uuml;-Element wird dann ausgew&auml;hlt, welche &quot;Instanz&quot; der
        Seite, also mit den Inhalten welches Produktes, jeweils angezeigt werden
        soll.</p>
      <p class="elementCodeHeading">Dieses WebYep Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php webyep_menu(&quot;Feldname&quot;, false, &quot;die_seite.php&quot;, &quot;einFrame&quot;, &quot;&quot;, &quot;&quot;); ?&gt; <!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" --><noscript>
      <div class="javaScriptWarning">Sie können die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript><!-- #EndLibraryItem --><div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">webyep_menu()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Men&uuml;-Elementes&quot; weiter unten)</span>
          <ol>
            <li> <span class="codeExample">&quot;Feldname&quot;</span>: Ein Text &ndash; der Name f&uuml;r dieses Element. </li>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; der G&uuml;ltigkeitsbereich dieses Elementes. <br>
                <span class="codeExample">true</span> wenn das Element in <em>allen</em> Seiten den selben Inhalt haben soll (global).<br>
                <span class="codeExample">false</span> wenn es auf jeder Seite, auf der es platziert ist, andere Inhalte haben soll.</li>
            <li><span class="codeExample">&quot;die_seite.php&quot;</span>: Ein Text&ndash; der URL der Seite, auf welche die Men&uuml;punkte verweisen sollen. </li>
            <li><span class="codeExample">&quot;einFrame&quot;</span>: Ein Text (optional) &ndash; der Name eines Frames (Rahmen), der f&uuml;r die Links der Men&uuml;punkte als &quot;target&quot; (Ziel) fungieren soll.<br>
      Geben Sie einen Leertext (&quot;&quot;) an, wenn Sie kein Frameset verwenden. </li>
            <li><span class="codeExample">&quot;&quot;</span>: Ein Text &ndash; nicht mehr verwendet. Geben Sie einen Leertext (&quot;&quot;) an. </li>
            <li><span class="codeExample">&quot;&quot;</span>: Ein Text &ndash; nicht mehr verwendet. Geben Sie einen Leertext (&quot;&quot;) an. </li>
          </ol>
      </div>
      <p>Die Men&uuml;punkte k&ouml;nnen von den BenutzerInnen direkt im Webbrowser (im Men&uuml;-Bearbeiten-Fenster) ver&auml;ndert, hinzugef&uuml;gt, gel&ouml;scht werden und sie k&ouml;nnen auch die Reihenfolge der Men&uuml;punkte festlegen.</p>
      <p align="center"><img src="pictures/menu-inpage.gif" width="359" height="347"><br>
          <span class="picturetext">Das Men&uuml;-Element in Aktion - durch Klicken auf den Bearbeiten-Knopf (&quot;Produktmen&uuml; bearbeiten &quot;)<br>
&ouml;ffnet sich das Men&uuml;-Bearbeiten-Fenster</span></p>
      <p align="center"><img src="pictures/menu-editor.gif" width="510" height="548"><br>
          <span class="picturetext"> Das Men&uuml;-Bearbeiten-Fenster</span></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><h3><a name="aussehen"></a>Hierarchische Men&uuml;s definieren</h3>
      <p>Die BernutzerInnen k&ouml;nnen einger&uuml;ckte Men&uuml;punkte (Untermen&uuml;punkte) erzeugen, indem Sie dem Men&uuml;eintrag ein oder mehrere Leerzeichen (oder Unterstriche &quot;_&quot;) vornstellen. Sie k&ouml;nnen auch Untermen&uuml;titel erzeugen (die &uuml;blicherweise ein Untermen&uuml; einleiten), indem sie einem Men&uuml;eintrag eine Raute (&quot;#&quot;) vornstellen.</p>
      <p>Ein typisches hierarchisches Men&uuml; k&ouml;nnte also folgenderma&szlig;en aussehen:</p>
      <blockquote class="codeExample"> Erster Hauptmen&uuml;eintrag<br>
        Zweiter Hauptmen&uuml;eintrag<br>
        #Ein Untermen&uuml;titel<br>
        _Erster Untermen&uuml;eintrag<br>
        _Zweiter Untermen&uuml;eintrag<br>
        Dritter Hauptmen&uuml;eintrag</blockquote>
      <h3>Dynamische oder statische Men&uuml;s</h3>
      <p>Ein WebYep Men&uuml; wird durch die HTML Tags &lt;ul&gt; und &lt;li&gt;, also eine Aufz&auml;hlungsliste, repr&auml;sentiert. Untermen&uuml;zweige werden  durch Verschachteln solcher Listen generiert. Diese Untermen&uuml;s k&ouml;nnen  dynamisch auf- und zugeklappt werden, indem auf einen Untermen&uuml;titel geklickt wird, wenn in der WebYep Konfiguration (konfiguration.php) die Verwendung von JavaScript aktiviert ist (was die Standardeinstellung ist):</p>
      <blockquote class="codeExample"> $webyep_sMenuType = &quot;listJS&quot;;</blockquote>
      <p>Tragen Sie hier den Wert  <span class="codeExample">&quot;list&quot;</span> ein, um nur statische Men&uuml;s ohne JavaScript zu erzeugen.</p>
      <p>Beachten Sie, dass das Men&uuml;-Element JavaScript im &quot;<span class="codeExample">listJS</span>&quot;-Modus lediglich defensiv einsetzt: Wenn JavaScript nicht zur Verf&uuml;gung steht, wird automatisch ein statisches Men&uuml; (in dem alle Men&uuml;b&auml;ume eingeblendet sind) erzeugt. Dies stellt auch einen barrierefreien Zugang zum Men&uuml; sicher.</p>
      <h3><a name="aussehen"></a>Gestalten des Men&uuml;s</h3>
      <p>WebYep vergibt beim generieren des HTML-Codes f&uuml;r jeden Men&uuml;eintrag einen oder mehrere CSS-Klassen, je nachdem welcher Art der Eintrag ist (normaler Men&uuml;eintrag oder Untermen&uuml;titel) bzw. in welchem Status er sich befindet (selektiert, aufgeklappt). Indem Sie in Ihrem Stylesheet oder direkt in Ihrer Seite CSS-Stile f&uuml;r diese Klassen definieren, k&ouml;nnen Sie das Aussehen des Men&uuml;s detailliert beeinflussen.</p>
      <h4>Liste der CSS-Klassen:</h4>
      <table border="1" cellspacing="0" cellpadding="0" class="description">
        <tr>
          <td><strong>CSS Klassenname</strong></td>
          <td><strong>Zugewiesen wenn....</strong></td>
        </tr>
        <tr>
          <td class="codeExample">WebYepMenuItem</td>
          <td>der Eintrag ein normaler Men&uuml;eintrag ist (kein Untermen&uuml;titel).</td>
        </tr>
        <tr>
          <td class="codeExample">WebYepMenuTitle</td>
          <td> der Eintrag ein Untermen&uuml;titel ist.</td>
        </tr>
        <tr>
          <td class="codeExample">WebYepMenuCurrentItem</td>
          <td> der Eintrag der gerade selektierte Men&uuml;eintrag ist.</td>
        </tr>
        <tr>
          <td class="codeExample">WebYepMenuTitleExpanded</td>
          <td> der Eintrag der Titel eines Untermen&uuml;s ist, das gerade ausgeklappt ist.</td>
        </tr>
        <tr>
          <td class="codeExample">WebYepMenuFirstItem</td>
          <td> der Eintrag der erste in seinem Men&uuml;zweig ist (z.B. f&uuml;r Trennlinien verwendbar)</td>
        </tr>
      </table>
      <p>Jeder Men&uuml;eintrag besteht aus einem &lt;li&gt;-Tag der einen &lt;a&gt;-Tag (Link) enth&auml;lt. Die CSS-Klassen werden beiden Tags zugewiesen. Manchmal werden auch mehr als nur eine CSS-Klasse zugewiesen. Der Titel eines ausgeklappten Untermen&uuml;s wird z.B. die beiden Klassen &quot;WebYepMenuTitle&quot; und &quot;WebYepMenuTitleExpanded&quot; zugewiesen bekommen.</p>
      <p class="remark"><span class="remarkHeading">Hinweis:</span> Auf unserer Website gibt es Beispiele f&uuml;r die Verwendung von CSS zum Gestalten von Men&uuml;s: <a href="http://www.obdev.at/webyep/" target="_blank">http://www.obdev.at/webyep/</a></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><h2><a name="eigenschaften">Eigenschaften des Men&uuml;-Elementes</a></h2>
<p align="center"><img src="pictures/menu-inspector.gif" width="445" height="107"><br>
    <span class="picturetext">Das Eigenschaftsfenster f&uuml;r das Men&uuml;-Element</span></p>
<h3>Men&uuml;name</h3>
<p>  Eine Bezeichnung f&uuml;r das Men&uuml;-Element. Der Men&uuml;name wird in der Webseite im &quot;Bearbeiten&quot;-Modus angezeigt, damit die BenutzerInnen bei der Eingabe die verschiedenen Men&uuml;-Elemente unterscheiden k&ouml;nnen.</p>
<h3><a name="gueltig">Inhalte</a></h3>
<p> Ist hier &quot;in diesem Dokument&quot; eingestellt, so ist dieses Men&uuml; von den Men&uuml;s <em>anderer Seiten</em> <em>unabh&auml;ngig</em>, auch wenn diese den <em>gleichen Men&uuml;namen</em> aufweisen. Wenn Sie das Men&uuml; <em>auf mehreren Seiten</em> platzieren m&ouml;chten, ist diese Einstellung auf &quot;in allen Dokumenten&quot; zu setzen.</p>
<h3><a name="pageURL"></a>Seite (URL)</h3>
<p>Name (bzw. vollst&auml;ndiger URL) der Seite, die beim Klick auf einen Men&uuml;eintrag angezeigt werden soll. Meist wird das der Name der Seite sein, in der sich das Men&uuml;-Element befindet (die Seite verweist also sozusagen auf sich selbst). </p>
<h3><a name="targetFrame"></a>Ziel (frame) - bei Verwendungen von Rahmen (target frame)</h3>
<p>Wenn die unter der Eigenschaft &quot;Seite (URL)&quot; angegebene Seite beim
  Klick auf einen Men&uuml;eintrag in einem <em>anderen Rahmen</em> dargestellt
  werden soll, ist bei der Eigenschaft &quot;Ziel (frame)&quot; der Name des
  betreffenden Rahmens anzugeben.</p>
<!-- #BeginLibraryItem "/Library/webyep_di.lbi" --><div class="remark">
        <p><span class="remarkHeading">Hinweis:</span> Sie k&ouml;nnen einen Men&uuml;punkt auch direkt mit einem Link von einer anderen Seite aus anspringen, indem
          Sie beim Link an den URL
          folgendes
          anh&auml;ngen:</p>
        <blockquote>
          <p class="codeExample">?WEBYEP_DI=x</p>
        </blockquote>
        <p>wobei &quot;x&quot; f&uuml;r die Identifikations-Nummer des Men&uuml;eintrages steht - also zB.:</p>
        <blockquote>
          <p class="codeExample">eine_seite_mit_menue.php?WEBYEP_DI=1</p>
        </blockquote>
        <p>Sie k&ouml;nnen die Identifikations-Nummer eines Men&uuml;eintrages leicht herausfinden, indem Sie den Men&uuml;eintrag im WebBrowser einfach anklicken und so die entsprechende Unterseite aufrufen - dann sehen Sie in der URL-Zeile (Adress-Zeile) des WebBrowsers den URL der Seite mit oben erw&auml;hntem &quot;<span class="codeExample">?WEBYEP_DI=...</span>&quot;. </p>
        </div>
<!-- #EndLibraryItem --><!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><!-- InstanceEndEditable -->
    <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
<div style="page-break-before: always"></div>
<table width="100%" border="0" cellspacing="0" cellpadding="6">
  <tr>
    <td width="100%" align="left" valign="top" class="content"><h1><!-- InstanceBeginEditable name="Title" -->Schleife<!-- InstanceEndEditable --></h1>
      <!-- InstanceBeginEditable name="Content" -->
      <p align="center"><img src="pictures/loop-start-palette.gif" width="224" height="32" align="absmiddle"><img src="../images/nix.gif" width="32" height="8" align="absmiddle"><img src="pictures/loop-end-palette.gif" width="224" height="32" align="absmiddle"><br>
          <span class="picturetext">Die Symbole f&uuml;r das Schleifen-Element in der Objektpalette:<br>
  Links &quot;Schleifen-Start&quot;, rechts &quot;Schleifen-Ende&quot;</span></p>
      <p>Einen <em>Block von Elementen</em> auf einer Seite <em>beliebieg oft
          zu wiederholen</em> ist der Sinn der WebYep-Schleife. Die wiederholten
          Elemente k&ouml;nnen dabei WebYep-Elemente (Kurztext-Element, Bild-Element,
          ...), aber auch herk&ouml;mmliche HTML-Elemente (Texte, Abs&auml;tze,
          Bilder, Tabellen, ...) sein. Alles was sich zwischen dem <em>Schleifen-Start-</em> und
          dem <em>Schleifen-End-Element</em> befindet, bildet einen Block, der
          einfach nach Wunsch wiederholt wird. Das Entscheidende aber ist: WebYep-Elemente
          innerhalb des sich wiederholenden Blocks k&ouml;nnen bei <em>jeder
          Wiederholung andere Inhalte</em> haben!</p>
      <p class="elementCodeHeading">Das Schleifen-Start-Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php foreach (WYLoopElement::aLoopIDs(<span style="color: red">&quot;Schleifenname&quot;</span>) as $webyep_oCurrentLoop-&gt;iLoopID) { $webyep_oCurrentLoop-&gt;loopStart(<span style="color: red">true</span>); ?&gt; <!-- #BeginLibraryItem "/Library/code_detail.lbi" --> <span class="elementCodeLink"><a href="javascript:toggleCodeDetails()">Details...</a></span><!-- #EndLibraryItem --></p>
      <!-- #BeginLibraryItem "/Library/noscript_warning-de.lbi" --><noscript>
      <div class="javaScriptWarning">Sie können die "Details..." nicht sehen, da JavaScript in Ihrem Browser deaktiviert ist!</div>
      </noscript><!-- #EndLibraryItem --><div id="elementCodeDetails">Parameter der PHP Funktion <span class="codeExample">aLoopIDs()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Schleifen-Elementes&quot; weiter unten)</span>
          <ol>
            <li> <span class="codeExample">&quot;Schleifenname&quot;</span>: Ein Text &ndash; der Name f&uuml;r dieses Element. </li>
          </ol>
          Parameter der PHP Funktion <span class="codeExample">loopStart()</span>:<br>
          <span class="small">(siehe auch &quot;Eigenschaften des Schleifen-Elementes&quot; weiter unten)</span>
          <ol>
            <li><span class="codeExample">true/false</span>: Ein boolscher Wert &ndash; gibt an, ob die Schleifen-Editier-Kn&ouml;pfe automatisch eingebunden werden sollen. <br>
                <span class="codeExample">true</span> wenn die Editier-Kn&ouml;pfe automatisch am Beginn jedes Blocks eingef&uuml;gt werden sollen.<br>
                <span class="codeExample">false</span> wenn nicht. Sie m&uuml;ssen dann den PHP-Code f&uuml;r diese Editier-Kn&ouml;pfe manuell an der gew&uuml;nschten Stelle einf&uuml;gen &ndash; siehe dazu auch &quot;<a href="#eigenschaften">Autom. Edit-Kn&ouml;pfe</a>&quot; weiter unten. </li>
          </ol>
      </div>
      <p class="elementCodeHeading">Das Schleifen-Ende-Element wird durch folgenden PHP Code repr&auml;sentiert:</p>
      <p class="elementCode">&lt;?php $webyep_oCurrentLoop-&gt;loopEnd(); } ?&gt; </p>
      <h3>Einsatz des Schleifen-Elementes</h3>
      <p>Um das Schleifen-Element anzuwenden, erzeugen Sie in Ihrer Seite einfach einige HTML- und/oder WebYep-Elemente (den Schleifen-Inhalt). Setzen Sie dann den Schleifen-Start vor diese Elemente und das Schleifen-Ende nach diese Elemente:</p>
      <p align="center"><img src="pictures/loop-dw.gif" width="501" height="278"></p>
      <p>&nbsp;</p>
      <p>In der Website pr&auml;sentiert sich die Schleife dann f&uuml;r die
        BetrachterInnen so als w&uuml;rde sich der Schleifen-Block einfach mehrmals
        wiederholen, jedes mal mit anderen Inhalten allerdings:</p>
      <p align="center"><img src="pictures/loop-inpage-1.gif" width="341" height="448"></p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><p align="left">Im &quot;Bearbeiten&quot;-Modus im Webbrowser werden <em>oberhalb
          jedes Blocks</em> bis zu vier Symbole eingeblendet, mit denen die Bl&ouml;cke
          ver&auml;ndert werden k&ouml;nnen:</p>
      <p align="center"><img src="pictures/loop-inpage-2.gif" width="341" height="448"></p>
      <p>Wobei die einzelnen Symbole folgende Funktion haben:</p>
      <table border="0" align="center" cellpadding="6" cellspacing="0">
        <tr>
          <td align="left" valign="top"><a name="edit_symbole"></a><img src="pictures/loop-button-plus.gif" width="33" height="26"></td>
          <td align="left" valign="middle"><p>Neuen Block darunter hinzuf&uuml;gen.</p></td>
        </tr>
        <tr>
          <td align="left" valign="top"><img src="pictures/loop-button-trash.gif" width="33" height="26"></td>
          <td align="left" valign="middle"><p>Block l&ouml;schen</p></td>
        </tr>
        <tr>
          <td align="left" valign="top"><img src="pictures/loop-button-up.gif" width="33" height="26"></td>
          <td align="left" valign="middle"><p>Block Richtung Anfang  verschieben</p></td>
        </tr>
        <tr>
          <td align="left" valign="top"><img src="pictures/loop-button-down.gif" width="33" height="26"></td>
          <td align="left" valign="middle"><p>Block Richtung Ende  verschieben</p></td>
        </tr>
      </table>
      <h3 align="left">Positionierung von Schleifen-Start und -Ende</h3>
      <p align="left">Wenn Sie ein HTML-Element (wie einen Absatz &quot;&lt;p&gt;&quot; oder
        eine Tabelle &quot;&lt;table&gt;&quot;) wiederholen wollen, m&uuml;ssen
        Sie nur darauf achten, dass Sie den Start exakt vor das Element und das
        Ende exakt nach das Element setzen - siehe dazu &quot;<a href="../tutorials/index.html#positioning">Positionierung
        im Dokument</a>&quot; in der Einleitung zu den Tutorials.</p>
      <p align="left">In manchen F&auml;llen kann es n&ouml;tig sein, den Schleifen-Start
        und das Schleifen-Ende im HTML-Code genauer zu platzieren um exakt festzulegen,
        <em>was</em> wiederholt werden soll. Sie k&ouml;nnen die PHP-Bl&ouml;cke f&uuml;r den
        Schleifen-Start und das -Ende (jeweils durch &quot;&lt;?php&quot; und &quot;?&gt;&quot; eingegrenzt)
        im HTML-Code beliebig verschieben.</p>
      <p align="left">Zur &Uuml;berpr&uuml;fung k&ouml;nnen Sie Ihre Seite im Webbrowser aufrufen
        und im Webbrowser den HTML-Quellcode anzeigen lassen - dort sehen Sie
        eindeutig, welcher HTML-Code durch das Schleifen-Element aufgrund Ihrer
        Positionierung erstellt wird.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><h2><a name="eigenschaften"></a>Eigenschaften des Schleifen-Start-Elementes</h2>
      <p align="center"><img src="pictures/loop-inspector.gif" width="346" height="107"><br>
      <span class="picturetext">Das Eigenschaftsfenster f&uuml;r das Schleifen-Start-Element</span></p>
      <h3>Bezeichnung</h3>
      <p>  Eine Bezeichnung f&uuml;r das Schleifen-Element. Wird nicht in der Seite angezeigt, ist aber f&uuml;r die interne Untscheidung erforderlich, wenn mehrere Schleifen auf einer Seite platziert werden.<br>
  Bitte <em>immer</em> einen eindeutigen Namen angeben!</p>
      <h3>Autom. Edit-Kn&ouml;pfe</h3>
      <p>Die <a href="#edit_symbole">vier Symbole</a> zum Bearbeiten der Bl&ouml;cke werden im &quot;Bearbeiten&quot;-Modus &uuml;berhalb des jeweiligen Blocks nur eingeblendet, wenn dieses H&auml;kchen gesetzt ist (standard).</p>
      <p>Wenn Sie in speziellen F&auml;llen den Schleifen-Start an eine Stelle
        des HTML-Codes setzen wollen, an dem die Symbole (aus HTML-syntaktischen
        Gr&uuml;nden) nicht eingef&uuml;gt werden d&uuml;rfen, sollten Sie dieses
        H&auml;kchen ausschalten. Sie m&uuml;ssen dann aber an geeigneter Stelle
        innerhalb des Blocks folgenden Code in den HTML-Code einf&uuml;gen:</p>
      <blockquote class="codeExample">
        <p class="codeExample">&lt;?php $webyep_oCurrentLoop-&gt;showEditButtons(); ?&gt;</p>
      </blockquote>
      <p>Ein typisches Beispiel hierf&uuml;r w&auml;re, wenn Sie den Schleifen-Start
        zwischen &lt;table&gt;-Tag und &lt;tr&gt;-Tag setzen, um nur die Tabellenzeilen
        und nicht die ganze Tabelle zu wiederholen. Das Schleifen-Ende m&uuml;sste
        in diesem Fall zwischen &lt;/tr&gt;-Tag und &lt;/table&gt;-Tag gesetzt
        werden. Innerhalb einer der Tabellenzellen m&uuml;sste dann obiges Code-Fragment
        platziert werden.</p>
      <h2>Eigenschaften des Schleifen-Ende-Elementes</h2>
      <p>Das Schleifen-Ende-Element hat keine einstellbaren Eigenschaften.</p>
      <!-- #BeginLibraryItem "/Library/up.lbi" -->
<!-- #EndLibraryItem --><!-- InstanceEndEditable -->
      <div><img src="../images/nix.gif" width="8" height="24"></div></td>
  </tr>
</table>
</body>
</html>
